const equip_preset = {
  "키아나_레인저": [
    ["극초반 (회피로 모으고 생쿠 QTE로 연계)", "달신"],
    ["급식 심연세팅", "달신 롤피피"],
  ],
  "키아나_투예복": [
    ["극초반 (삐로냐의 QTE 트리거)", "콜트"],
    ["극초반 (체공, 시공봉인 QTE 트리거)", "달신"],
  ],
  "키아나_성녀": [
    ["초반 심연세팅", "달신 롤흑흑"],
    ["심연 보스전세팅", "세컨 이드이"],
  ],
  "키아나_월광": [
    ["마비딜러 세팅", "템버린 케케클"],
    ["급식 세팅", "달신 테리리"],
  ],

  "카렌_괴도": [
    ["종결 세팅", "아리아 농3셋"],
    ["급식 세팅", "달신 키라3셋"],
  ],
  "카렌_예장": [
    ["종결 세팅", "정위총 미막미"],
    ["급식 세팅", "물요 카네쓰구 바토리 아틸"],
  ],

  "브로냐_채리엇": [
    ["기억전장 범용세팅", "사나다 철흑흑"],
    ["기억전장 급식세팅", "요르문 메흑흑"],
  ],

  "브로냐_황매화": [
    ["급식 방어력 세팅 (무기는 아무거나, S랭크 달성 후 사용)", "마르코프 바샤롤"],
    ["쿨감소 세팅 (무기는 아무거나)", "마르코프 제섹섹"],
  ],

  "브로냐_설원": [
    ["심연 딜러세팅 (틱뎀을 못버티면 철이이)", "오쓰 철막막"],
    ["심연 궁셔틀세팅", "티르 테수나태"],
  ],

  "브로냐_차원": [
    ["심연세팅", "티르 철지뉴"],
    ["원소파티 서포터세팅", "티르 물풍물풍뉴턴"],
  ],

  "브로냐_은랑": [
    ["유다 서포터세팅", "발칸 장광장광뉴턴"],
    ["유다 서포터세팅 (급식)", "돼지빔 하임상오지에오지에"],
  ],

  "브로냐_침식": [
    ["기억전장 세팅1", "사나다 철막신"],
    ["기억전장 세팅2", "사나다 철막이"],
  ],




  "테레사_서약": [
    ["유다 세팅", "유다 섹수오"],
    ["급식셋 (*효율낮음)", "화염의천사 기원3셋"],
  ],

  "테레사_처형복": [
    ["QTE 세팅", "짭다 드흑흑"],
    ["급식셋", "화염의천사 기원3셋"],
  ],

  "테레사_앵화윤무": [
    ["화염딜링 세팅", "마법봉 비여비"],
    ["급식셋", "낙뢰의천사 키라3셋"],
  ],

  "테레사_신은송가": [
    ["범용셋", "11쓰 송가3셋"],
    ["급식셋", "화염의천사 기원3셋"],
  ],

  "테레사_월하초옹": [
    ["물리딜러 세팅", "짭다 미막미"],
    // ["추천셋2", "짭다 미막미"],
    ["급식셋", "화염의천사 기원3"],
  ],
}

export default equip_preset