const equip_preset = {
  "키아나_레인저": [
    ["극초반 (회피로 모으고 생쿠 QTE로 연계)", "달신"],
    ["급식 심연세팅", "달신 롤피피"],
  ],
  "키아나_투예복": [
    ["극초반 (삐로냐의 QTE 트리거)", "콜트"],
    ["극초반 (체공, 시공봉인 QTE 트리거)", "달신"],
  ],
  "키아나_성녀": [
    ["초반 심연세팅", "달신 롤흑흑"],
    ["심연 보스전세팅", "세컨 이드이"],
  ],
  "키아나_월광": [
    ["마비딜러 세팅", "케케클"],
    ["급식 세팅", "테리리"],
  ],

  "카렌_괴도": [
    ["종결 세팅", "아리아 농3셋"],
    ["급식 세팅", "달신 키라3셋"],
  ],
  "카렌_예장": [
    ["종결 세팅", "정위총 미막미"],
    ["급식 세팅", "물요 카네쓰구 바토리 아틸"],
  ],

  "테레사_서약": [
    ["유다 세팅", "유다 섹수오"],
    ["급식셋 (*효율낮음)", "화염의천사 기원3셋"],
  ],

  "테레사_처형복": [
    ["QTE 세팅", "짭다 드흑흑"],
    ["급식셋", "화염의천사 기원3셋"],
  ],

  "테레사_앵화윤무": [
    ["화염딜링 세팅", "마법봉 비여비"],
    ["급식셋", "낙뢰의천사 키라3셋"],
  ],

  "테레사_신은송가": [
    ["범용셋", "11쓰 송가3셋"],
    ["급식셋", "화염의천사 기원3셋"],
  ],

  "테레사_월하초옹": [
    ["물리딜러 세팅", "짭다 미막미"],
    // ["추천셋2", "짭다 미막미"],
    ["급식셋", "화염의천사 기원3"],
  ],
}

export default equip_preset