const stigma3 = {
    "data": {
      "바톨": {
        "oName": "바토리",
        "one": "바",
        "short": "바톨",
        "hairColor": ["lightOrange"],
        "imgs": ["232B0933597FDBC20E", "2497C433597FDBF704", "21C25E33597FDC2714"],
        "texts": [
          "HP80% 이상시, 방어력 31% 증가",
          "HP80% 이상시, 물리피해 20% 증가",
          "HP80% 이상시, 이동속도 41% 증가"
        ],
        "setTexts": [
          "근접 물리피해 20% 증가 / 생물타입 장비시, 전투중 SP상한 10% 증가",
          "공격 적중시, 10% 확률로 HP3% 회복(쿨타임2초)"
        ]
      },
      "왕소군": {
        "oName": "왕소군",
        "one": "왕소군",
        "short": "왕소군",
        "hairColor": ["red"],
        "imgs": ["27D1F733597FDBC814", "243B3C33597FDBFC3D", "25526D33597FDC2D0A"],
        "texts": [
          "전투중 HP상한 26% 증가",
          "전투중 방어력 21% 증가",
          "전투중 SP상한 10% 증가"
        ],
        "setTexts": [
          "원거리 물리피해 20% 증가 / 이능타입 장비시, 전투중 SP상한 10% 증가",
          "스킬 SP소모량 15% 감소"
        ]
      },
      "아틸라": {
        "oName": "아틸라",
        "one": "아",
        "short": "아틸라",
        "hairColor": ["brown"],
        "imgs": ["22698D33597FDBC609", "27720D33597FDC2B1A", "26200633597FDBFA0D"],
        "texts": [
          "10 콤보 이상시, 이동속도 15% 증가",
          "20 콤보 이상시, 방어력 41% 증가",
          "30 콤보 이상시, 물리피해 31% 증가"
        ],
        "setTexts": [
          "폭격피해 30% 증가 / 기계타입 장비시, 전투중 SP상한 10% 증가",
          "전투중 회심 40% 증가"
        ]
      },
      "료마": {
        "oName": "사카모토 료마",
        "one": "료마",
        "short": "료마",
        "hairColor": ["lightBlue"],
        "imgs": ["21D9B333597FDBC313", "25361633597FDBF74A", "270D7133597FDC280F"],
        "texts": [
          "충전 물리피해 18% 증가 (브로냐, 히메코의 차지공격)",
          "연계 물리피해 41% 증가 (QTE포함)",
          "분기 물리피해 26% 증가"
        ],
        "setTexts": [
          "쉴드 상태인 적에게 모든피해 10% 증가",
          "상태이상 지속시간 35% 감소"
        ]
      },
      "테슬라": {
        "oName": "테슬라",
        "one": "테",
        "short": "테슬라",
        "hairColor": ["red"],
        "imgs": ["22E39233597FDBCC13", "21972D33597FDBFF17", "2544EB33597FDC301E"],
        "texts": [
          "마비 상태인 적에게 모든피해 51% 증가",
          "빙결 상태인 적에게 모든피해 51% 증가",
          "기절 상태인 적에게 모든피해 51% 증가"
        ],
        "setTexts": [
          "쉴드가 깨진 적에게 모든피해 15% 증가",
          "전기 원소피해 30% 증가"
        ]
      },
      "물놀이": {
        "oName": "헌원 물놀이",
        "one": "물놀이",
        "short": "물놀이",
        "hairColor": ["black"],
        "imgs": ["22637633597FDBCC0A", "21A87833597FDC0016", "25ED8A33597FDC3111"],
        "texts": [
          "분기 물리피해 15% 증가",
          "충전 물리피해 15% 증가 (브로냐, 히메코 차지공격)",
          "연계 물리피해 31% 증가 (QTE포함)"
        ],
        "setTexts": [
          "쉴드가 깨진 적에게 모든피해 10% 증가",
          "이동속도 10% 증가"
        ]
      },
      "에디슨": {
        "oName": "에디슨",
        "one": "에디슨",
        "short": "에디슨",
        "hairColor": ["lightBlue"],
        "imgs": ["21E43133597FDBC743", "212E2433597FDBFB1D", "257CAB33597FDC2C1A"],
        "texts": [
          "6초마다 한번 일반공격에 510 전기 원소피해가 부가 (충전, 분기 포함)",
          "6초마다 한번 배리어를 생성, 피격시 102 만큼 피해가 감소",
          "6초마다 한번 일반 공격이 적의 이동속도를 30% 감소, 지속시간 4초 (충전, 분기 포함)",
        ],
        "setTexts": [
          "7초에 한번 일반 물리피해 60% 증가 (충전, 분기 포함)",
          "방어력 30% 증가 / 히메코 장비시, 전투중 HP상한 20% 증가",
        ]
      },
      "마로냐": {
        "oName": "브로냐 마력",
        "one": "마",
        "short": "마로냐",
        "hairColor": ["olive"],
        "imgs": ["264DBD33597FDBC30B", "22BBC933597FDBF714", "225B9B33597FDC2809"],
        "texts": [
          "충전 물리피해 20% 증가 (브로냐, 히메코의 차지공격)",
          "원거리 물리피해 15% 증가, 브로냐 장비시, 전투중 HP상한 10% 증가",
          "화염 원소피해 20% 증가",
        ],
        "setTexts": [
          "모든피해 10% 증가 / 브로냐 장비시, 연계 모든피해 10% 증가 (QTE포함)",
          "이동속도 15% 증가",
        ]
      },
      "롤랑": {
        "oName": "롤랑",
        "one": "롤",
        "short": "롤랑",
        "hairColor": ["olive"],
        "imgs": ["250D3133597FDBC10F", "211CA633597FDBF50D", "2640BB33597FDC260B"],
        "texts": [
          "3초마다 HP46 회복",
          "상태이상 효과를 받을시, 51% 확률로 해당 상태이상 무효",
          "HP80% 이상시 방어력 31% 증가"
        ],
        "setTexts": [
          "이능타입에게 받는 피해 20% 감소 / 키아나 장비시, 전투중 HP상한 20% 증가",
          "이능타입에게 입히는 물리피해 20% 증가 / 키아나 장비시, 전투중 폭격률 10% 증가"
        ]
      },
      "히메코성탄": {
        "oName": "히메코 성탄",
        "one": "히메코성탄",
        "short": "히메코성탄",
        "hairColor": ["red"],
        "imgs": ["24C1D133597FDBCD15", "24B5D033597FDC0115", "2570C233597FDC311B"],
        "texts": [
          "이동속도 8%증가 / 히메코 장비시 이동속도 8% 추가 증가",
          "히메코 장비시 주위 적들의 이동속도와 공격속도 15% 감소",
          "공격 적중시 SP3 회복 시켜주는 징글벨 드랍 (쿨타임5초) / 징글벨 유지 시간 8초 / 히메코 장비시 회복 효과 2배",
        ],
        "setTexts": [
          "충전 물리피해 15% 증가 (브로냐, 히메코의 차지공격)",
          "기계타입에게 입히는 물리피해 10% 증가 / 히메코 장비시 물리피해 10% 증가",
        ]
      },
      "샤를": {
        "oName": "샤를마뉴",
        "one": "샤",
        "short": "샤를",
        "hairColor": ["lightBrown"],
        "imgs": ["21EAC133597FDBC312", "24C55233597FDBF813", "238ED233597FDC2818"],
        "texts": [
          "SP70% 이상시, SP5% 추가될때마다 일반 물리피해 4%씩 증가 (충전, 분기 포함)",
          "SP70% 이상시, 방어력 75% 증가",
          "SP70% 이상시, 이동속도 25% 증가"
        ],
        "setTexts": [
          "SP70% 이상시, 주위의 모든적들의 공격력과 방어력 20% 감소",
          "기계타입에게 입히는 물리피해 20% 증가 / 메이 또는 사쿠라 장비시, 전투중 HP상한 25% 증가"
        ]
      },
      "오지에": {
        "oName": "오지에",
        "one": "오지에",
        "short": "오지에",
        "hairColor": ["gold"],
        "imgs": ["27C31C33597FDBC815", "271DA233597FDBFC1E", "271DA233597FDBFC1E"],
        "texts": [
          "SP20% 이하시, 일반 물리피해 20% 증가 (충전, 분기 포함)",
          "SP20% 이하시, 받는 물리피해 25% 감소",
          "SP20% 이하시, 이동속도 25% 증가",
        ],
        "setTexts": [
          "전투중 HP상한 15% 증가 / SP20% 이하시 0.5초마다 주위 적에게 공격력의 35%만큼 물리피해를 입힌다",
          "생물타입에게 입히는 물리피해 20% 증가 / 브로냐 장비시 폭격피해 40% 증가",
        ]
      },
      "차차": {
        "oName": "아자이 차차",
        "one": "차",
        "short": "차차",
        "hairColor": ["grey", "olive"],
        "imgs": ["23295733597FDBC61F", "25310433597FDBFA0C", "25AC5433597FDC2B16"],
        "texts": [
          "퇴장시, 다음 발키리의 받는 화염 원소피해 26% 감소 / 등장시, 자신의 근접 물리피해 15% 증가",
          "입히는 화염 원소피해 31% 증가, 받는 화염 원소피해 20% 감소",
          "전투중인 적 하나당 이동속도, 방어력 8% 증가, 최대 5중첩",
        ],
        "setTexts": [
          "퇴장시, 4m내의 적에게 공격력 200%의 화염 원소피해를 주는 화염파동을 가한다 (쿨타임30초) / 키아나 장비시 2개의 화염파동을 생성한다",
          "화염파동 범위 2m 증가 / 공격력의 200%의 화염 원소피해를 추가로 입히고 화상 상태 부여 / 화상은 0.5초마다 공격력의 30%의 화염 원소피해를 가한다",
        ]
      },
      "카네쓰구": {
        "oName": "나오에 카네쓰구",
        "one": "카네쓰구",
        "short": "카네쓰구",
        "hairColor": ["green"],
        "imgs": ["2191AF33597FDBC017", "2723AA33597FDBF43E", "26F5A733597FDC2510"],
        "texts": [
          "쉴드가 깨진 적에게 모든피해 25%, 폭격률 15% 증가",
          "받는 화염 원소피해 25% 감소 / 자신이 화염 원소피해를 받을 경우 4초간 물리피해 40% 증가 (쿨타임 10초) ",
          "주변에 적이 있을경우 매 4초마다 HP2%씩 회복",
        ],
        "setTexts": [
          "정면에서 받는 물리피해 80% 감소 / 측면에서 받는 물리피해 40% 감소 / 회피시 20초간 감소효과 무효",
          "전투 돌입시, 보스방 진입시 20초간 물리피해 40%, 방어력 60% 증가 (쿨타임 60초)",
        ]
      },
      "단오": {
        "oName": "단오",
        "one": "단오",
        "short": "단오",
        "isHairColorDiff": true,
        "hairColor": [["white"], ["black"], ["white", "olive"]],
        "imgs": ["22DE6933597FDBC135", "22E8ED33597FDBF510", "22F54133597FDC260F"],
        "texts": [
          "분기 물리피해 20% 증가, 분기공격 폭격률 5% 증가",
          "공격 적중시 10% 확률로 적에게 2초간 마비 상태 부여 (쿨타임 5초)",
          "상태이상 지속시간 30% 감소 / 출장기 물리피해 25% 증가 (QTE 포함)",
        ],
        "setTexts": [
          "전투중 HP,SP상한 10% 증가",
          "HP70% 이상에서 HP가 5%씩 증가할때 마다 물리피해 6%씩 증가",
        ]
      },
      "기원": {
        "oName": "테레사 기원",
        "one": "기원",
        "short": "기원",
        "hairColor": ["white"],
        "imgs": ["27392433597FDBCB0D", "21BC5933597FDBFF02", "2653BD33597FDC300A"],
        "texts": [
          "무기 액티브 스킬 사용시, 6초간 모든피해 30% 증가",
          "무기 액티브 스킬 사용시, 쿨타임 30% 감소",
          "무기 액티브 스킬 사용시, 4초간 공격속도 25% 감소",
        ],
        "setTexts": [
          "모든 팀원이 정면에서 받는 피해 20% 감소 / 테레사 장비시, SP상한 20% 증가",
          "모든 팀원이 입히는 일반 물리피해 15% 증가 / 테레사 장비시 일반 물리피해 15% 추가증가 (충전, 분기 포함)",
        ]
      },
      "리날도": {
        "oName": "리날도",
        "one": "리",
        "short": "리날도",
        "hairColor": ["lightBlue"],
        "imgs": ["994A433359AB4F0931", "998EB83359AB4F092E", "9969A73359AB4F0A24"],
        "texts": [
          "폭격시 자신 주위 2m 적들에게 공격력 150%의 물리피해를 입힌다 (쿨타임 5초)",
          "폭격시 자신 주위 2m 적들을 1.5초동안 마비 시킨다 (쿨타임 5초)",
          "폭격시 자신의 HP120 회복 (쿨타임 8초)"
        ],
        "setTexts": [
          "폭격률 15% 증가",
          "적을 죽일시 6초동안 폭격피해 50%증가, 지속 시간 연장 가능"
        ]
      },
      "키라": {
        "oName": "시구레 키라",
        "one": "키라",
        "short": "키라",
        "hairColor": ["white"],
        "imgs": ["992C983A5A99FB551B", "99CA673A5A99FB561F", "998FF33A5A99FB5617"],
        "texts": [
          "모든 원소피해 15% 증가",
          "전투중 HP 15%, 방어 15% 증가",
          "극한회피시 모든 원소피해가 5초간 20% 증가. 재발동시 지속시간 초기화",
        ],
        "setTexts": [
          "받는 물리피해 15% 감소",
          "주는 모든피해 15% 증가",
        ]
      },
      "갈릴": {
        "oName": "갈릴레오",
        "one": "갈",
        "short": "갈릴",
        "hairColor": ["brown"],
        "imgs": ["99033D4A5ADA94C91D", "99D85A4A5ADA94C81F", "993DDC4A5ADA94C828"],
        "texts": [
          "극한회피 후 5.0초간, 주는 모든피해 15% 증가, 재발동시 지속시간 초기화",
          "모든피해 5%중가, 체공상태의 적에게 주는 모든피해 10% 증가",
          "같은 적을 공격시 (2.5초간 공격하지 않으면 리셋) / 공격마다 폭격률 1% 중가, 최대 10%까지 증가",
        ],
        "setTexts": [
          "근접 폭격피해 30% 증가",
          "간접 물리피해 40% 감소",
        ]
      },
      "호무": {
        "oName": "호무",
        "one": "호무",
        "short": "호무",
        "hairColor": ["yellow"],
        "imgs": ["99A4554D5AEF10732C", "99F6BD4D5AEF107424", "996CF24D5AEF10742F"],
        "texts": [
          "일반공격(충전, 분기 포함) 적중시, 50% 확률로 하임 코인이 떨어짐. (쿨타임 4초) / 매 코인당 자신이 주는 모든피해를 10% 증가시킴. (10초 지속, 최대 3중첩)",
          "아이템 습득 범위 1.5배 증가",
          "이동속도 20% 증가",
        ],
        "setTexts": [
          "연속으로 하임 코인 획득 후, 획득한 곳에 폭발하는 하임을 생성하여 4m 범위에 공격력 400%에 해당하는 물리 피해를 입힘.",
          "코인 3개 획득시, 자신의 HP 및 SP 10% 회복",
        ]
      },
      "류노": {
        "oName": "아쿠타가와 류노스케",
        "one": "류",
        "short": "류노",
        "hairColor": ["black"],
        "imgs": ["9936434B5B24B2171C", "99DA514B5B24B21823", "997CCA4B5B24B2182A"],
        "texts": [
          "근접 물리피해 20% 증가",
          "콤보당 회심 5 증가, 최대 25",
          "콤보당 공격속도 2% 증가, 최대 10% 증가",
        ],
        "setTexts": [
          "출격시 자신 최대 HP의 15% 만큼 피해를 흡수하는 쉴드를 획득. 쉴드가 존재할 경우 폭격 피해량 40%증가, 파괴시 15초 후 재생성",
          "근접 모든 피해 20% 증가",
        ]
      },
      "모래사장": {
        "oName": "여름 모래사장",
        "one": "모래",
        "short": "모래사장",
        "isHairColorDiff": true,
        "hairColor": [["white"], ["white"], ["red"]],
        "imgs": ["S4BK_1", "S4BK_2", "S4BK_3"],
        "texts": [
          "원거리 물리 피해 10% 증가",
          "원거리 공격 폭격 피해 35% 증가",
          "받는 원거리 피해 5% 감소, 전투 중 생명령 상한치 10% 증가",
        ],
        "setTexts": [
          "원거리 공격으로 적 명중 시 적 반경 3.5미터 범위에 자신의 공격력의 200%의 물리 피해를 준다, 쿨타임 5초",
          "공격 속도 20% 증가",
        ]
      },
    },
    "token": {
      "바": "바톨",
      "바톨": "바톨",
      "바토리": "바톨",
      "왕소군": "왕소군",
      "왕소금": "왕소군",
      "아": "아틸라",
      "아틸": "아틸라",
      "아틸라": "아틸라",
      "료마": "료마",
      "로마": "료마",
      "물놀": "물놀이",
      "물놀이": "물놀이",
      "헌원물놀이": "물놀이",
      "헌원 물놀이": "물놀이",
      "에디슨": "에디슨",
      "마": "마로냐",
      "마로": "마로냐",
      "마로냐": "마로냐",
      "마력브로냐": "마로냐",
      "브로냐마력": "마로냐",
      "마력 브로냐": "마로냐",
      "브로냐 마력": "마로냐",
      "히메코성탄": "히메코성탄",
      "히메코 성탄": "히메코성탄",
      "테슬": "테슬라",
      "테슬라": "테슬라",
      "롤": "롤랑",
      "롤랑": "롤랑",
      "샤": "샤를",
      "샤를": "샤를",
      "샤를마뉴": "샤를",
      "오지에": "오지에",
      "오지애": "오지에",
      "오지에구요": "오지에",
      "차": "차차",
      "차차": "차차",
      "카네쓰구": "카네쓰구",
      "단오": "단오",
      "기": "기원",
      "기원": "기원",
      "테레사기원": "기원",
      "테레사 기원": "기원",
      "리": "리날도",
      "리날": "리날도",
      "리날도": "리날도",
      "리날드": "리날도",
      "키라": "키라",
      "시구레키라": "키라",
      "시구레 키라": "키라",
      "시구레": "키라",
      "갈": "갈릴",
      "갈릴": "갈릴",
      "갈릴레오": "갈릴",
      "호": "호무",
      "호무": "호무",
      "하임": "호무",
      "류": "류노",
      "류노": "류노",
      "루노": "류노",
      "류노스케": "류노",
      "아쿠타가와": "류노",
      "모래": "모래사장",
      "모래사장": "모래사장",
    },
    "exception": {
      "철기뉴": "철수 기원 뉴턴",
      "철테섹": "철수 테슬라 셰익",
      "철테셱": "철수 테슬라 셰익",
      "테리아": "테슬라 리날도 아틸라",
      "테리클": "테슬라 리날도 클레오",
      "테케클": "테슬라 케플러 클레오",
      "테리리": "테슬라 리날도 리날도",
      "테케케": "테슬라 케플러 케플러",
    }
  }


export default stigma3