const stigma3 = {
    "data": {
      "바톨": {
        "oName": "바토리",
        "one": "바",
        "short": "바톨",
        "imgs": ["232B0933597FDBC20E", "2497C433597FDBF704", "21C25E33597FDC2714"],
        "texts": [
          "HP80% 이상시, 방어력 31% 증가",
          "HP80% 이상시, 물리피해 20% 증가",
          "HP80% 이상시, 이동속도 41% 증가"
        ],
        "setTexts": [
          "근접 물리피해 20% 증가 / 생물타입 장비시, 전투중 SP상한 10% 증가",
          "공격 적중시, 10% 확률로 HP3% 회복(쿨타임2초)"
        ]
      },
      "왕소군": {
        "oName": "왕소군",
        "one": "왕소군",
        "short": "왕소군",
        "imgs": ["27D1F733597FDBC814", "243B3C33597FDBFC3D", "25526D33597FDC2D0A"],
        "texts": [
          "전투중 HP상한 26% 증가",
          "전투중 방어력 21% 증가",
          "전투중 SP상한 10% 증가"
        ],
        "setTexts": [
          "원거리 물리피해 20% 증가 / 이능타입 장비시, 전투중 SP상한 10% 증가",
          "스킬 SP소모량 15% 감소"
        ]
      },
      "아틸라": {
        "oName": "아틸라",
        "one": "아",
        "short": "아틸라",
        "imgs": ["22698D33597FDBC609", "27720D33597FDC2B1A", "26200633597FDBFA0D"],
        "texts": [
          "10 콤보 이상시, 이동속도 15% 증가",
          "20 콤보 이상시, 방어력 41% 증가",
          "30 콤보 이상시, 물리피해 31% 증가"
        ],
        "setTexts": [
          "폭격피해 30% 증가 / 기계타입 장비시, 전투중 SP상한 10% 증가",
          "전투중 회심 40% 증가"
        ]
      },
    },
    "token": {
      "바": "바톨",
      "바톨": "바톨",
      "바토리": "바톨",
      // "왕": "왕소군",
      // "소금": "왕소군",
      // "왕소": "왕소군",
      "왕소군": "왕소군",
      "왕소금": "왕소군",
      "아": "아틸라",
      "아틸": "아틸라",
      "아틸라": "아틸라",
    }
  }


export default stigma3




// 상 : 사카모토 료마

// 충전 물리피해 18% 증가 (브로냐, 히메코의 차지공격)

// 중 : 사카모토 료마

// 연계 물리피해 41% 증가 (QTE포함)

// 하 : 사카모토 료마

// 분기 물리피해 26% 증가

// 세트 옵션 :

// 쉴드 상태인 적에게 모든피해 10% 증가

// 상태이상 지속시간 35% 감소


// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]


// 상 : 테슬라

// 마비 상태인 적에게 모든피해 51% 증가

// 중 : 테슬라

// 빙결 상태인 적에게 모든피해 51% 증가

// 하 : 테슬라

// 기절 상태인 적에게 모든피해 51% 증가

// 세트 옵션 :

// 쉴드가 깨진 적에게 모든피해 15% 증가

// 전기 원소피해 30% 증가


// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 헌원 물놀이

// 분기 물리피해 15% 증가

// 중 : 헌원 물놀이

// 충전 물리피해 15% 증가 (브로냐, 히메코 차지공격)

// 하 : 헌원 물놀이

// 연계 물리피해 31% 증가 (QTE포함)

// 세트 옵션 :

// 쉴드가 깨진 적에게 모든피해 10% 증가

// 이동속도 10% 증가


// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 에디슨

// 6초마다 한번 일반공격에 510 전기 원소피해가 부가 (충전, 분기 포함)

// 중 : 에디슨

// 6초마다 한번 배리어를 생성, 피격시 102 만큼 피해가 감소

// 하 : 에디슨

// 6초마다 한번 일반 공격이 적의 이동속도를 30% 감소, 지속시간 4초 (충전, 분기 포함)

// 세트 옵션 :

// 7초에 한번 일반 물리피해 60% 증가 (충전, 분기 포함)

// 방어력 30% 증가
// 히메코 장비시, 전투중 HP상한 20% 증가


// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 브로냐 마력

// 충전 물리피해 20% 증가 (브로냐, 히메코의 차지공격)

// 중 : 브로냐 마력

// 원거리 물리피해 15% 증가, 브로냐 장비시, 전투중 HP상한 10% 증가

// 하 : 브로냐 마력

// 화염 원소피해 20% 증가

// 세트 옵션 :

// 모든피해 10% 증가
// 브로냐 장비시, 연계 모든피해 10% 증가 (QTE포함)

// 이동속도 15% 증가


// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 롤랑

// 3초마다 HP46 회복

// 중 : 롤랑

// 상태이상 효과를 받을시, 51% 확률로 해당 상태이상 무효

// 하 : 롤랑

// HP80% 이상시 방어력 31% 증가

// 세트 옵션 :

// 이능타입에게 받는 피해 20% 감소
// 키아나 장비시, 전투중 HP상한 20% 증가

// 이능타입에게 입히는 물리피해 20% 증가
// 키아나 장비시, 전투중 폭격률 10% 증가




// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]


// 상 : 히메코 성탄

// 이동속도 8%증가
// 히메코 장비시 이동속도 8% 추가 증가

// 중 : 히메코 성탄

// 히메코 장비시 주위 적들의 이동속도와 공격속도 15% 감소

// 하 : 히메코 성탄

// 공격 적중시 SP3 회복 시켜주는 징글벨 드랍 (쿨타임5초)
// 징글벨 유지 시간 8초
// 히메코 장비시 회복 효과 2배

// 세트 옵션 :

// 충전 물리피해 15% 증가 (브로냐, 히메코의 차지공격)

// 기계타입에게 입히는 물리피해 10% 증가
// 히메코 장비시 물리피해 10% 증가



// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]


// 상 : 샤를마뉴

// SP70% 이상시, SP5% 추가될때마다 일반 물리피해 4%씩 증가 (충전, 분기 포함)

// 중 : 샤를마뉴

// SP70% 이상시, 방어력 75% 증가

// 하 : 샤를마뉴

// SP70% 이상시, 이동속도 25% 증가

// 세트 옵션 :

// SP70% 이상시, 주위의 모든적들의 공격력과 방어력 20% 감소

// 기계타입에게 입히는 물리피해 20% 증가
// 메이 또는 사쿠라 장비시, 전투중 HP상한 25% 증가



// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 오지에

// SP20% 이하시, 일반 물리피해 20% 증가 (충전, 분기 포함)

// 중 : 오지에

// SP20% 이하시, 받는 물리피해 25% 감소

// 하 : 오지에

// SP20% 이하시, 이동속도 25% 증가

// 세트 옵션 :

// 전투중 HP상한 15% 증가
// SP20% 이하시 0.5초마다 주위 적에게 공격력의 35%만큼 물리피해를 입힌다

// 생물타입에게 입히는 물리피해 20% 증가
// 브로냐 장비시 폭격피해 40% 증가


// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 아자이 차차

// 퇴장시, 다음 발키리의 받는 화염 원소피해 26% 감소
// 등장시, 자신의 근접 물리피해 15% 증가

// 중 : 아자이 차차

// 입히는 화염 원소피해 31% 증가, 받는 화염 원소피해 20% 감소

// 하 : 아자이 차차

// 전투중인 적 하나당 이동속도, 방어력 8% 증가, 최대 5중첩

// 세트 옵션 :

// 퇴장시, 4m내의 적에게 공격력 200%의 화염 원소피해를 주는 화염파동을 가한다 (쿨타임30초)
// 키아나 장비시 2개의 화염파동을 생성한다

// 화염파동 범위 2m 증가
// 공격력의 200%의 화염 원소피해를 추가로 입히고 화상 상태 부여
// 화상은 0.5초마다 공격력의 30%의 화염 원소피해를 가한다




// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 나오에 카네쓰구

// 쉴드가 깨진 적에게 모든피해 25%, 폭격률 15% 증가

// 중 : 나오에 카네쓰구

// 받는 화염 원소피해 25% 감소
// 자신이 화염 원소피해를 받을 경우 4초간 물리피해 40% 증가 (쿨타임 10초)

// 하 : 나오에 카네쓰구

// 주변에 적이 있을경우 매 4초마다 HP2%씩 회복

// 세트 옵션 :

// 정면에서 받는 물리피해 80% 감소
// 측면에서 받는 물리피해 40% 감소
// 회피시 20초간 감소효과 무효

// 전투 돌입시, 보스방 진입시 20초간 물리피해 40%, 방어력 60% 증가 (쿨타임 60초)




// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 단오

// 분기 물리피해 20% 증가, 분기공격 폭격률 5% 증가

// 중 : 단오

// 공격 적중시 10% 확률로 적에게 2초간 마비 상태 부여 (쿨타임 5초)

// 하 : 단오

// 상태이상 지속시간 30% 감소
// 출장기 물리피해 25% 증가 (QTE 포함)

// 세트 옵션 :

// 전투중 HP,SP상한 10% 증가

// HP70% 이상에서 HP가 5%씩 증가할때 마다 물리피해 6%씩 증가




// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]




// 상 : 테레사 기원

// 무기 액티브 스킬 사용시, 6초간 모든피해 30% 증가

// 중 : 테레사 기원

// 무기 액티브 스킬 사용시, 쿨타임 30% 감소

// 하 : 테레사 기원

// 무기 액티브 스킬 사용시, 4초간 공격속도 25% 감소

// 세트 옵션 :

// 모든 팀원이 정면에서 받는 피해 20% 감소
// 테레사 장비시, SP상한 20% 증가

// 모든 팀원이 입히는 일반 물리피해 15% 증가
// 테레사 장비시 일반 물리피해 15% 추가증가 (충전, 분기 포함)



// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 리날도

// 폭격시 자신 주위 2m 적들에게 공격력 150%의 물리피해를 입힌다 (쿨타임 5초)

// 중 : 리날도

// 폭격시 자신 주위 2m 적들을 1.5초동안 마비 시킨다 (쿨타임 5초)

// 하 : 리날도

// 폭격시 자신의 HP120 회복 (쿨타임 8초)

// 세트 옵션 :

// 폭격률 15% 증가

// 적을 죽일시 6초동안 폭격피해 50%증가, 지속 시간 연장 가능


// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]



// 상 : 시구레 키라

// 모든 원소피해 15% 증가

// 중 : 시구레 키라

// 전투중 HP 15%, 방어 15% 증가

// 하 : 시구레 키라

// 극한회피시 모든 원소피해가 5초간 20% 증가. 재발동시 지속시간 초기화

// 세트 옵션 :

// 받는 물리피해 15% 감소

// 주는 모든피해 15% 증가





// 상 : 갈릴레오

// 극한회피 후 5.0초간, 주는 모든피해 15% 증가, 재발동시 지속시간 초기화

// 중 : 갈릴레오

// 모든피해 5%중가, 체공상태의 적에게 주는 모든피해 10% 증가

// 하 : 갈릴레오

// 같은 적을 공격시 (2.5초간 공격하지 않으면 리셋)
// 공격마다 폭격률 1% 중가, 최대 10%까지 증가

// 세트 옵션 :

// 근접 폭격피해 30% 증가

// 간접 물리피해 40% 감소


// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]




// 상 : 하임

// 일반공격(충전, 분기 포함) 적중시, 50% 확률로 하임 코인이 떨어짐. (쿨타임 4초)
// 매 코인당 자신이 주는 모든피해를 10% 증가시킴. (10초 지속, 최대 3중첩)

// 중 : 하임

// 아이템 습득 범위 1.5배 증가

// 하 : 하임

// 이동속도 20% 증가

// 세트 옵션 :

// 연속으로 하임 코인 획득 후, 획득한 곳에 폭발하는 하임을 생성하여 4m 범위에 공격력 400%에 해당하는 물리 피해를 입힘.

// 코인 3개 획득시, 자신의 HP 및 SP 10% 회복




// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]




// 상 : 아쿠타가와 류노스케

// 근접 물리피해 20% 증가

// 중 : 아쿠타가와 류노스케

// 콤보당 회심 5 증가, 최대 25

// 하 : 아쿠타가와 류노스케

// 콤보당 공격속도 2% 증가, 최대 10% 증가

// 세트 옵션 :

// 출격시 자신 최대 HP의 15% 만큼 피해를 흡수하는 쉴드를 획득. 쉴드가 존재할 경우 폭격 피해량 40%증가, 파괴시 15초 후 재생성

// 근접 모든 피해 20% 증가




// 출처: http://rosia.tistory.com/141 [Ryudmila's 취미생활]