const stigma3 = {
    "data": {
      "바톨": {
        "oName": "바토리",
        "one": "바",
        "short": "바톨",
        "imgs": ["232B0933597FDBC20E", "2497C433597FDBF704", "21C25E33597FDC2714"],
        "texts": [
          "HP80% 이상시, 방어력 31% 증가",
          "HP80% 이상시, 물리피해 20% 증가",
          "HP80% 이상시, 이동속도 41% 증가"
        ],
        "setTexts": [
          "근접 물리피해 20% 증가 / 생물타입 장비시, 전투중 SP상한 10% 증가",
          "공격 적중시, 10% 확률로 HP3% 회복(쿨타임2초)"
        ]
      },
      "왕소군": {
        "oName": "왕소군",
        "one": "왕소군",
        "short": "왕소군",
        "imgs": ["27D1F733597FDBC814", "243B3C33597FDBFC3D", "25526D33597FDC2D0A"],
        "texts": [
          "전투중 HP상한 26% 증가",
          "전투중 방어력 21% 증가",
          "전투중 SP상한 10% 증가"
        ],
        "setTexts": [
          "원거리 물리피해 20% 증가 / 이능타입 장비시, 전투중 SP상한 10% 증가",
          "스킬 SP소모량 15% 감소"
        ]
      },
      "아틸라": {
        "oName": "아틸라",
        "one": "아",
        "short": "아틸라",
        "imgs": ["22698D33597FDBC609", "27720D33597FDC2B1A", "26200633597FDBFA0D"],
        "texts": [
          "10 콤보 이상시, 이동속도 15% 증가",
          "20 콤보 이상시, 방어력 41% 증가",
          "30 콤보 이상시, 물리피해 31% 증가"
        ],
        "setTexts": [
          "폭격피해 30% 증가 / 기계타입 장비시, 전투중 SP상한 10% 증가",
          "전투중 회심 40% 증가"
        ]
      },
      "테슬라": {
        "oName": "테슬라",
        "one": "테",
        "short": "테슬라",
        "imgs": ["22E39233597FDBCC13", "21972D33597FDBFF17", "2544EB33597FDC301E"],
        "texts": [
          "마비 상태인 적에게 모든피해 51% 증가",
          "빙결 상태인 적에게 모든피해 51% 증가",
          "기절 상태인 적에게 모든피해 51% 증가"
        ],
        "setTexts": [
          "쉴드가 깨진 적에게 모든피해 15% 증가",
          "전기 원소피해 30% 증가"
        ]
      },
      "롤랑": {
        "oName": "롤랑",
        "one": "롤",
        "short": "롤랑",
        "imgs": ["250D3133597FDBC10F", "211CA633597FDBF50D", "2640BB33597FDC260B"],
        "texts": [
          "3초마다 HP46 회복",
          "상태이상 효과를 받을시, 51% 확률로 해당 상태이상 무효",
          "HP80% 이상시 방어력 31% 증가"
        ],
        "setTexts": [
          "이능타입에게 받는 피해 20% 감소 / 키아나 장비시, 전투중 HP상한 20% 증가",
          "이능타입에게 입히는 물리피해 20% 증가 / 키아나 장비시, 전투중 폭격률 10% 증가"
        ]
      },
      "샤를": {
        "oName": "샤를마뉴",
        "one": "샤",
        "short": "샤를",
        "imgs": ["21EAC133597FDBC312", "24C55233597FDBF813", "238ED233597FDC2818"],
        "texts": [
          "SP70% 이상시, SP5% 추가될때마다 일반 물리피해 4%씩 증가 (충전, 분기 포함)",
          "SP70% 이상시, 방어력 75% 증가",
          "SP70% 이상시, 이동속도 25% 증가"
        ],
        "setTexts": [
          "SP70% 이상시, 주위의 모든적들의 공격력과 방어력 20% 감소",
          "기계타입에게 입히는 물리피해 20% 증가 / 메이 또는 사쿠라 장비시, 전투중 HP상한 25% 증가"
        ]
      },
      "리날도": {
        "oName": "리날도",
        "one": "리",
        "short": "리날도",
        "imgs": ["994A433359AB4F0931", "998EB83359AB4F092E", "9969A73359AB4F0A24"],
        "texts": [
          "폭격시 자신 주위 2m 적들에게 공격력 150%의 물리피해를 입힌다 (쿨타임 5초)",
          "폭격시 자신 주위 2m 적들을 1.5초동안 마비 시킨다 (쿨타임 5초)",
          "폭격시 자신의 HP120 회복 (쿨타임 8초)"
        ],
        "setTexts": [
          "폭격률 15% 증가",
          "적을 죽일시 6초동안 폭격피해 50%증가, 지속 시간 연장 가능"
        ]
      },

    },
    "token": {
      "바": "바톨",
      "바톨": "바톨",
      "바토리": "바톨",
      "왕소군": "왕소군",
      "왕소금": "왕소군",
      "아": "아틸라",
      "아틸": "아틸라",
      "아틸라": "아틸라",
      "테슬": "테슬라",
      "테슬라": "테슬라",
      "롤": "롤랑",
      "롤랑": "롤랑",
      "샤": "샤를",
      "샤를": "샤를",
      "샤를마뉴": "샤를",
      "리": "리날도",
      "리날": "리날도",
      "리날도": "리날도",
    },
    "exception": {
      "테리클": "테슬라리날도클레오",
      "테케클": "테슬라케플러클레오",
      "테리리": "테슬라리날도리날도",
      "테케케": "테슬라케플러케플러",
    }
  }


export default stigma3