const stigma4 = {
    "data": {
      "클레오": {
        "oName": "클레오파트라",
        "one": "클",
        "short": "클레오",
        "imgs": ["230A2033597FDBCB10", "21CD3E33597FDBFF13", "23C76C33597FDC2F02"],
        "texts": [
          "쉴드가 깨진 적에게 모든피해 41% 증가",
          "기절 상태인 적에게 모든피해 82% 증가",
          "마비 상태인 적에게 모든피해 82% 증가"
        ],
        "setTexts": [
          "이동속도 25% 증가 / 키아나 장비시, 전투중 HP상한 20% 증가",
          "적과 거리가 1m 멀어질수록 원거리 물리피해 5%씩 증가 최대 10중첩"
        ]
      },
      "헌원": {
        "oName": "희헌원",
        "one": "헌",
        "short": "헌원",
        "imgs": ["267F5833597FDBCC08", "23C09233597FDC0014", "227CFD33597FDC311A"],
        "texts": [
          "연계 물리피해 62% 증가 (QTE포함)",
          "충전 물리피해 36% 증가 (브로냐, 히메코의 차지공격)",
          "무기 액티브 모든피해 41% 증가"
        ],
        "setTexts": [
          "상태이상 지속시간 50% 감소 / 메이 또는 사쿠라 장비시, 전투중 HP상한 20%증가",
          "5초마다 한번, 짧은 시간동안 일반 물리피해 80%, 폭격률 30% 증가 (충저, 분기 포함)"
        ]
      },
      "셰익": {
        "oName": "셰익스피어",
        "one": "섹",
        "short": "셰잌",
        "imgs": ["211F7133597FDBC40F", "243BA533597FDBF81C", "22CF4233597FDC2913"],
        "texts": [
          "전기 원소피해 51% 증가",
          "화염 원소피해 51% 증가",
          "빙결 원소피해 51% 증가"
        ],
        "setTexts": [
          "회피효과 쿨타임 35% 감소 / 이능타입 장비시, 전투중 SP상한 15% 증가",
          "스킬 SP소모량 20% 감소"
        ]
      },
      "예카": {
        "oName": "예카테리나",
        "one": "예",
        "short": "예카",
        "imgs": ["2438E033597FDBC80D", "21492433597FDBFB0A", "216F2533597FDC2C1B"],
        "texts": [
          "25 콤보 이상시, 방어력 61% 증가",
          "40 콤보 이상시, 물리피해 41% 증가",
          "10 콤보 이상시, 이동속도 31% 증가"
        ],
        "setTexts": [
          "전투중 회심 15% 증가 / 기계타입 장비시, 전투중 SP상한 15% 증가",
          "70 콤보 이상시, 폭격피해 120% 증가"
        ]
      },
      "이이": {
        "oName": "이이",
        "one": "이",
        "short": "이이",
        "imgs": ["23225C33597FDBC90F", "24960733597FDBFD17", "2182CD33597FDC2E19"],
        "texts": [
          "HP80% 이상시, 방어력 103% 증가",
          "HP60% 이상시, 이동속도 36% 증가",
          "HP100% 일시, 물리피해 46% 증가"
        ],
        "setTexts": [
          "공격 적중시, 15% 확률로 HP5% 회복 (쿨타임 2초) / 생물타입 장비시, 전투중 SP상한 15% 증가",
          "적의 끊기공격을 한번 막아주고 날려버린다 (쿨타임 5초)"
        ]
      },
      "아인": {
        "oName": "아인슈타인",
        "one": "아",
        "short": "아인",
        "imgs": ["22057C33597FDBC510", "27623E33597FDBFA1A", "24677C33597FDC2B1B"],
        "texts": [
          "차지 공격 쉴드 감소량 28% 증가, 자신의 HP 37% 이하시 입히는 모든 피해 36% 증가",
          "차지 공격 명중시 HP 44회복(쿨타임 : 3초) / 기계 속성을 공격시 SP 1.8회복(쿨타임 : 3초)",
          "차지 공격의 모든 피해 18% 증가 / 기계 속성을 공격시 SP 1.8회복(쿨타임 : 3초) 중복발동시 지속 시간 초기화"
        ],
        "setTexts": [
          "적과의 거리가 1M 멀어질 때마다 주는 모든 피해 5% 증가. 최대 5번 중첩",
          "적과의 거리가 가까울수록, 받는 모든 피해 감소. 최대 40% 감소"
        ]
      },
      "미켈": {
        "oName": "미켈란젤로",
        "one": "미",
        "short": "미켈",
        "imgs": ["9978ED3A5A99FB5618", "99E10A3A5A99FB5614", "99D9E83A5A99FB561D"],
        "texts": [
          "통상 공격마다(분기 및 차지 포함) 주는 물리피해 7.2% 증가 / 3초 지속, 5회 중첩, 중첩시 지속시간 초기화",
          "통상 공격마다(분기 및 차지 포함) 회심률 3% 증가 / 3초 지속, 5회 중첩, 중첩시 지속시간 초기화",
          "통상 공격마다(분기 및 차지 포함) 크리티컬 피해량 14% 증가 / 3초 지속, 5회 중첩, 중첩시 지속시간 초기화"
        ],
        "setTexts": [
          "주는 모든 피해 15% 증가 / 출격시 15초간 주는 모든피해 15% 증가(30초 간격)",
          "퇴장시, 10초간 초당 HP 2% 회복 / 출격시 모든 적에게 300% 물리피해를 입히고, 체력이 10% 이하인 적에게 추가로 300% 물리 피해를 입힘(30초 간격)"
        ]
      },
      "막스": {
        "oName": "막스 플랑크",
        "one": "막",
        "short": "막스",
        "imgs": ["21C82033597FDBC214", "24C65A33597FDBF613", "22F38C33597FDC2710"],
        "texts": [
          "HP10%씩 감소할때마다 모든피해 6.2% 씩 증가",
          "피격시 받는 물리피해 72% 증가 입히는 일반 물리피해 51% 증가 (충전, 분기 포함)",
          "이동속도 41% 감소, 공격속도 31% 증가 (충전, 분기 포함)"
        ],
        "setTexts": [
          "피격 데미지가 발키리레벨*15보다 낮으면 경직 무효, 브로냐 장비시 원거리 모든피해 15% 증가",
          "공격 적중시 HP5% 회복 (쿨타임 5초), 브로냐 장비시 SP회복량 30% 증가"
        ]
      },
      "시린": {
        "oName": "시린",
        "one": "시",
        "short": "시린",
        "imgs": ["99BF2C335A1BC20932", "99541F335A1BC22B0C", "99D1B8335A1BC26E12"],
        "texts": [
          "근접 물리피해 25% 증가, 체공상태적에게 20% 추가 증가.",
          "받은 원소피해 30% 감소, 자신이 상태이상시 20%로 무효.",
          "극한회피 후 1회 충전, 다음 공격 후 5초간 모든피해 35% 증가. / (쿨타임 1.5초)"
        ],
        "setTexts": [
          "메이 또는 사쿠라 장비시, 동일 대상을 지속적으로 공격시(2.5초간 공격을 하지 않을 경우 초기화) 매 공격당 폭격률 3%, 폭격피해 8% 증가 / 최대 중첩 수 5 (폭격률 15%, 폭격피해 40%)",
          "캐릭터가 등장 또는 HP60%이상시, 필드상의 적들이 주는 모든피해량를 15% 감소시키며, 입는 모든 피해량을 10% 증가시킨다. / 하나의 효과만 적용."
        ]
      },
    },
    "token": {
      "클": "클레오",
      "클레오": "클레오",
      "클레오파트라": "클레오",
      "헌": "헌원",
      "희헌원": "헌원",
      "헌원": "헌원",
      "이이": "이이",
      "아인슈타인": "아인",
      "아인": "아인",
      "섹": "셰익",
      "셱": "셰익",
      "셐": "셰익",
      "셰익": "셰익",
      "세익": "셰익",
      "셰잌": "셰익",
      "세잌": "셰익",
      "막": "막스",
      "막스": "막스",
      "미": "미켈",
      "미켈": "미켈",
      "시": "시린",
      "시린": "시린",
      "예": "예카",
      "예카": "예카",
      "예가": "예카",
    }
  }


export default stigma4