const stigma4 = {
    "data": {
      "클레오": {
        "oName": "클레오파트라",
        "one": "클",
        "short": "클레오",
        "imgs": ["230A2033597FDBCB10", "21CD3E33597FDBFF13", "23C76C33597FDC2F02"],
        "texts": [
          "쉴드가 깨진 적에게 모든피해 41% 증가",
          "기절 상태인 적에게 모든피해 82% 증가",
          "마비 상태인 적에게 모든피해 82% 증가"
        ],
        "setTexts": [
          "이동속도 25% 증가 / 키아나 장비시, 전투중 HP상한 20% 증가",
          "적과 거리가 1m 멀어질수록 원거리 물리피해 5%씩 증가 최대 10중첩"
        ]
      },
      "헌원": {
        "oName": "희헌원",
        "one": "헌",
        "short": "헌원",
        "imgs": ["267F5833597FDBCC08", "23C09233597FDC0014", "227CFD33597FDC311A"],
        "texts": [
          "연계 물리피해 62% 증가 (QTE포함)",
          "충전 물리피해 36% 증가 (브로냐, 히메코의 차지공격)",
          "무기 액티브 모든피해 41% 증가"
        ],
        "setTexts": [
          "상태이상 지속시간 50% 감소 / 메이 또는 사쿠라 장비시, 전투중 HP상한 20%증가",
          "5초마다 한번, 짧은 시간동안 일반 물리피해 80%, 폭격률 30% 증가 (충저, 분기 포함)"
        ]
      },
      "셰익": {
        "oName": "셰익스피어",
        "one": "섹",
        "short": "셰익",
        "imgs": ["211F7133597FDBC40F", "243BA533597FDBF81C", "22CF4233597FDC2913"],
        "texts": [
          "전기 원소피해 51% 증가",
          "화염 원소피해 51% 증가",
          "빙결 원소피해 51% 증가"
        ],
        "setTexts": [
          "회피효과 쿨타임 35% 감소 / 이능타입 장비시, 전투중 SP상한 15% 증가",
          "스킬 SP소모량 20% 감소"
        ]
      },
      "예카": {
        "oName": "예카테리나",
        "one": "예",
        "short": "예카",
        "imgs": ["2438E033597FDBC80D", "21492433597FDBFB0A", "216F2533597FDC2C1B"],
        "texts": [
          "25 콤보 이상시, 방어력 61% 증가",
          "40 콤보 이상시, 물리피해 41% 증가",
          "10 콤보 이상시, 이동속도 31% 증가"
        ],
        "setTexts": [
          "전투중 회심 15% 증가 / 기계타입 장비시, 전투중 SP상한 15% 증가",
          "70 콤보 이상시, 폭격피해 120% 증가"
        ]
      },
      "이이": {
        "oName": "이이",
        "one": "이",
        "short": "이이",
        "imgs": ["23225C33597FDBC90F", "24960733597FDBFD17", "2182CD33597FDC2E19"],
        "texts": [
          "HP80% 이상시, 방어력 103% 증가",
          "HP60% 이상시, 이동속도 36% 증가",
          "HP100% 일시, 물리피해 46% 증가"
        ],
        "setTexts": [
          "공격 적중시, 15% 확률로 HP5% 회복 (쿨타임 2초) / 생물타입 장비시, 전투중 SP상한 15% 증가",
          "적의 끊기공격을 한번 막아주고 날려버린다 (쿨타임 5초)"
        ]
      },
      "아인": {
        "oName": "아인슈타인",
        "one": "아",
        "short": "아인",
        "imgs": ["22057C33597FDBC510", "27623E33597FDBFA1A", "24677C33597FDC2B1B"],
        "texts": [
          "차지 공격 쉴드 감소량 28% 증가, 자신의 HP 37% 이하시 입히는 모든 피해 36% 증가",
          "차지 공격 명중시 HP 44회복(쿨타임 : 3초) / 기계 속성을 공격시 SP 1.8회복(쿨타임 : 3초)",
          "차지 공격의 모든 피해 18% 증가 / 기계 속성을 공격시 SP 1.8회복(쿨타임 : 3초) 중복발동시 지속 시간 초기화"
        ],
        "setTexts": [
          "적과의 거리가 1M 멀어질 때마다 주는 모든 피해 5% 증가. 최대 5번 중첩",
          "적과의 거리가 가까울수록, 받는 모든 피해 감소. 최대 40% 감소"
        ]
      },
      "복희": {
        "oName": "복희",
        "one": "복",
        "short": "복희",
        "imgs": ["21879F33597FDBC218", "234B8033597FDBF71B", "26BA7233597FDC2715"],
        "texts": [
          "빙결 상태인 적에게 모든 원소피해 92% 증가",
          "마비 상태인 적에게 모든 원소피해 92% 증가",
          "화상 상태인 적에게 모든 원소피해 51% 증가"
        ],
        "setTexts": [
          "전투중 HP상한 15% 증가 / 필살기와 회피효과 쿨타임 20% 감소",
          "필드내 적의 수가 3명 이상시 받는 모든 원소피해 50% 감소 / 입히는 모든 원소피해 60% 증가"
        ]
      },
      "여와": {
        "oName": "여와",
        "one": "여",
        "short": "여와",
        "imgs": ["246AF633597FDBC709", "26633C33597FDBFB19", "22D0F233597FDC2C13"],
        "texts": [
          "화상 상태인 적을 공격 적중시, 폭발하여 주위 적에게 공격력 82%에 해당하는 화염 원소피해를 가한다 (쿨타임 1.5초)",
          "1 콤보당 1%의 화염 원소피해 증가, 최대 102 중첩",
          "화상 상태이상의 원소피해, 지속시간 103% 증가"
        ],
        "setTexts": [
          "소환물의 모든 피해 60% 증가",
          "필드내 소환물이 하나 추가 될때마다 (친구, 동료 포함) 자신의 모든피해 20%씩 증가, 최대 5중첩"
        ]
      },
      "신농": {
        "oName": "신농",
        "one": "신농",
        "short": "신농",
        "imgs": ["2197EE33597FDBC517", "25183F33597FDBF91E", "23A41033597FDC2A17"],
        "texts": [
          "SP팩 획득시, 10초간 물리피해, 방어력 61% 증가 (쿨타임 15초)",
          "골드코인 획득시, 7초간 공격속도, 이동속도 51% 증가 (쿨타임 10초)",
          "피격시, 5초간 최대 HP의 31% 피해를 견디는 배리어 생성 (원소피해 포함) (쿨타임 12초)"
        ],
        "setTexts": [
          "허약 상태이상에 걸린 적에게 피격시 40% 확률로 데미지 무효 (원소피해 미포함) (쿨타임 3초)",
          "HP팩과 SP팩의 치료효과 50% 증가"
        ]
      },
      "정위": {
        "oName": "정위",
        "one": "정",
        "short": "정위",
        "imgs": ["25964433597FDBC917", "224A3333597FDBFD3C", "24AFE233597FDC2E16"],
        "texts": [
          "필드내 전투중인 적의 수가 1 이하시, 모든피해 31% 증가",
          "필드내 전투중인 적의 숫자가 3기 이하시, 이동 속도 31% 증가 / 분기/차지 공격으로 적중시 화염 원소 피해 36% 증가, 지속 시간 5초 / 중복 발동시 지속 시간 초기화",
          "필드내 전투중인 적의 숫자가 2기 이하시, 방어력 41% 증가 / 출격후 자신의 HP가 50%이하인 경우 1초마다 HP가 17씩 회복"
        ],
        "setTexts": [
          "필드내 연소, 이화 상태의 적 하나당 공격 속도 10% 증가 / 최대 5중첩",
          "타겟팅된 적 이외 적에게 받는피해 70% 감소"
        ]
      },
      "뉴턴": {
        "oName": "아이작 뉴턴",
        "one": "뉴",
        "short": "뉴턴",
        "imgs": ["22C84A33597FDBC514", "2304E033597FDBF90F", "23C2B033597FDC2A14"],
        "texts": [
          "근접 물리피해 46% 증가, 2회 피격시 10 초간 무효",
          "피격시, 4초간 이동속도 41% 증가하며 최대 HP의 21% 의 피해를 견디는 배리어 생성 (쿨타임 15초)",
          "공격 적중시, 적을 5초간 도발 (쿨타임 10초) / 도발에 걸린 적이 주는 모든피해 41% 증가, 받는 모든피해 31% 증가"
        ],
        "setTexts": [
          "일반공격 적중시 10% 확률로 마비, 빙결, 감속, 기절, 화상, 허약 중 한가지 상태이상을 6초간 부여 (충전, 분기 포함) (쿨타임 2초)",
          "1초마다 다음 일반 모든피해 20%씩 증가, 최대 5중첩 / 중첩효과는 공격시 짧은 시간동안만 받는다 (쿨타임 7초)"
        ]
      },
      "슈뢰딩거": {
        "oName": "슈뢰딩거",
        "one": "철",
        "short": "슈뢰딩거",
        "imgs": ["27C79C33597FDBC414", "262CE833597FDBF91D", "21AEE533597FDC2916"],
        "texts": [
          "6초마다 한번 다음 일반 모든피해가 50% 확률로 205% 증가 또는 52% 증가 (충전, 분기 포함)",
          "회피효과와 필살기 사용시 쿨타임이 50% 확률로 51% 감소 또는 20% 증가",
          "매 4초마다 충전 다음 일반공격 SP획득량이 50% 확률로 308% 증가 또는 100% 감소 (충전, 분기 포함)"
        ],
        "setTexts": [
          "피격 데미지가 50% 확률로 70% 감소 또는 40% 증가",
          "이 성흔 세트로 얻을 수 있는 이로운 효과의 확률 10% 증가 / 히메코 장비시 10% 추가 증가"
        ]
      },
      "막스": {
        "oName": "막스 플랑크",
        "one": "막",
        "short": "막스",
        "imgs": ["21C82033597FDBC214", "24C65A33597FDBF613", "22F38C33597FDC2710"],
        "texts": [
          "HP10%씩 감소할때마다 모든피해 6.2% 씩 증가",
          "피격시 받는 물리피해 72% 증가 입히는 일반 물리피해 51% 증가 (충전, 분기 포함)",
          "이동속도 41% 감소, 공격속도 31% 증가 (충전, 분기 포함)"
        ],
        "setTexts": [
          "피격 데미지가 발키리레벨*15보다 낮으면 경직 무효, 브로냐 장비시 원거리 모든피해 15% 증가",
          "공격 적중시 HP5% 회복 (쿨타임 5초), 브로냐 장비시 SP회복량 30% 증가"
        ]
      },
      "제갈": {
        "oName": "제갈량",
        "one": "제",
        "short": "제갈",
        "imgs": ["251E9933597FDBCA31", "2632EF33597FDBFE0B", "24A62F33597FDC2E17"],
        "texts": [
          "회피효과(방어) 쿨타임 26% 감소",
          "피격시 31% 확률로 피해 418 감소",
          "20, 50, 100 콤보 도달시, 방어력 41%, 82%, 123% 증가"
        ],
        "setTexts": [
          "피격시 4초 동안 끊기공격 면역 (쿨타임 10초) / 키아나 장비시 전투중 HP상한 30% 증가",
          "피격시 20% 확률로 3m 내의 모든 적을 날려버린다 (쿨타임 6초)"
        ]
      },
      "흑헌원": {
        "oName": "흑헌원",
        "one": "흑",
        "short": "흑헌원",
        "imgs": ["25D4B833597FDBCD14", "27CF8733597FDC0013", "27F0D533597FDC3111"],
        "texts": [
          "시공단열이 열리면 공격력의 450% 물리피해를 주위의 적에게 입힌다 (쿨타임 20초)",
          "시공단열 중 폭격률 30% 증가",
          "시공단열 중 이동속도 30% 공격속도 25% 증가"
        ],
        "setTexts": [
          "시공단열 중 물리피해 40% 증가 / 키아나 장비시 일반공격이 SP4 회복 (분기 포함) (쿨타임 2초)",
          "시공단열 중 스킬 SP소모량 30% 감소"
        ]
      },
      "이홍": {
        "oName": "이이홍",
        "one": "이",
        "short": "이홍",
        "imgs": ["25C13A33597FDBC815", "27943333597FDBFC17", "26532D33597FDC2D1D"],
        "texts": [
          "전투중 HP상한 20% 감소 / 일반 모든피해 36% 증가 (충전, 분기 포함)",
          "전투중 HP상한 15% 감소 / 1초마다 주위 적에게 공격력의 103% 만큼 물리피해를 입힌다 / 자신은 3초마다 HP20 회복",
          "전투중 HP상한 15% 감소 / 이동속도 15%, 공격속도 20% 증가"
        ],
        "setTexts": [
          "받는 물리피해 25% 감소, 간접 물리피해 70% 감소 (출혈 등)",
          "HP5% 이하시 6초간 폭격률과 폭격피해가 80% 증가 / 사망면역 상태가 된다 (쿨타임 60초)"
        ]
      },
      "카렌서약": {
        "oName": "카렌 서약",
        "one": "카렌서약",
        "short": "카렌서약",
        "imgs": ["27E28433597FDBCA13", "254C3133597FDBFE0A", "232CA933597FDC2F0D"],
        "texts": [
          "일반 공격 적중시, 52% 확률로 주위 적에게 공격력의 123% 의 물리피해를 입힌다 (쿨타임 2초)",
          "전투중 HP상한 20% 증가 / 상태이상에 걸릴 경우 31% 확률로 해당 상태이상 무효",
          "엘리트 적에게 입히는 물리피해 21% 증가, 받는 물리피해 21% 감소"
        ],
        "setTexts": [
          "필드내 엘리트적 하나당 폭격률 8% 증가 최대 4중첩",
          "엘리트 적을 죽일시, 120초간 일반 물리피해 15% 증가 최대 3중첩 (시간은 갱신되지 않음)"
        ]
      },
      "유키무라": {
        "oName": "유키무라",
        "one": "유키무라",
        "short": "유키무라",
        "imgs": ["23DF4133597FDBC813", "247FFA33597FDBFC05", "22490D33597FDC2D1D"],
        "texts": [
          "전투 돌입시 일반 물리피해 35% 증가 (충전, 분기 포함) 15초 지속 (쿨타임 30초)",
          "전투 돌입시 폭격률 25% 증가 (충전, 분기 포함) 15초 지속 (쿨타임 30초)",
          "전투 돌입시 방어력 300% 증가 (충전, 분기 포함) 15초 지속 (쿨타임 30초)"
        ],
        "setTexts": [
          "단일 피해가 자신의 체력 20% 이상시, 데미지 무효 (쿨타임 25초)",
          "성흔 세트로 얻는 모든 효과 15% 증가 / 메이 또는 사쿠라 장비시, 전투중 HP상한 20% 증가"
        ]
      },
      "지크": {
        "oName": "지크프리드 카스라나",
        "one": "지",
        "short": "지크",
        "imgs": ["27B4DE33597FDBCA04", "24191133597FDBFE30", "244EA533597FDC2F1D"],
        "texts": [
          "무기 액티브 사용시, SP소모량 25% 감소 / 6초간 공격속도 35% 증가",
          "무기 액티브 사용시, 쿨타임 40% 감소 / 6초간 방어력 50% 증가",
          "무기 액티브 사용시, 모든피해 35% 증가 / 6초간 이동속도 20% 증가"
        ],
        "setTexts": [
          "무기 액티브를 10초내 재사용시 다음 무기 액티브 모든피해를 20% 증가, 최대 5중첩",
          "무기 액티브 6회 사용시, 20초간 용자모드 돌입 (쿨타임 60초) / (용자모드 : 물리피해 70% 증가, 공격속도 및 이동속도 25% 증가, 상태이상 면역)"
        ]
      },
      "복희": {
        "oName": "복희",
        "one": "복",
        "short": "복희",
        "imgs": ["21879F33597FDBC218", "234B8033597FDBF71B", "26BA7233597FDC2715"],
        "texts": [
          "빙결 상태인 적에게 모든 원소피해 92% 증가",
          "마비 상태인 적에게 모든 원소피해 92% 증가",
          "화상 상태인 적에게 모든 원소피해 51% 증가"
        ],
        "setTexts": [
          "전투중 HP상한 15% 증가 / 필살기와 회피효과 쿨타임 20% 감소",
          "필드내 적의 수가 3명 이상시 받는 모든 원소피해 50% 감소 / 입히는 모든 원소피해 60% 증가"
        ]
      },
      "세실": {
        "oName": "세실리아 샤니아트",
        "one": "세",
        "short": "세실",
        "imgs": ["242D2B33597FDBC40E", "275F5933597FDBF81A", "223A9E33597FDC291E"],
        "texts": [
          "블랙스타 : 일반 물리피해 50% 증가 / 화이트스타 : 분기 물리피해 50% 증가",
          "블랙스타 : 일반공격시 SP4 획득 (쿨타임 1.5초) / 화이트스타 : 분기공격시 HP2% 회복 (쿨타임 1.5초)",
          "블랙스타 : 공격속도 40% 증가 / 화이트스타 : 적의 공격으로 입는 모든피해 40% 감소"
        ],
        "setTexts": [
          "블랙, 화이트 스타 점등 (2개 이상 장비해야만 성흔 효과 발동) / 블랙스타 : 일반공격시 보스가 아닌 적에게 20% 확률로 1000% 물리피해를 입힌다. (쿨타임 5초) / 화이트스타 : 분기공격 폭격률 30% 증가",
          "등장시 블랙, 화이트 점등할때마다 모든피해 12% 증가 최대 3중첩 / 퇴장시 모든 중첩 소멸"
        ]
      },
      "노히메": {
        "oName": "노히메",
        "one": "농",
        "short": "노히메",
        "imgs": ["2420E433597FDBC140", "24846D33597FDBF417", "2526E933597FDC250D"],
        "texts": [
          "일반공격시(충전, 분기 포함) 15% 확률로 4 초간 빙결 상태이상 부여 (쿨타임 8초) / 빙결 상태이상에 걸린 적에게 모든피해 40% 증가",
          "1초마다 공격에 공격력의 80% 만큼 빙결 원소피해 부가",
          "필드상 빙결 혹은 이동속도 감소효과를 받은 적 하나당 자신의 이동속도 10%와 빙결 원소피해 25% 증가 최대 3중첩"
        ],
        "setTexts": [
          "주위 적이 있을시, 매 1초마다 공격력의 60% 만큼 빙결 원소피해를 주고 30% 확률로 4초간 이동속도를 감소",
          "전투중 HP상한 20% 증가 빙결 원소피해 80% 증가"
        ]
      },
      "야에사쿠라": {
        "oName": "야에사쿠라",
        "one": "사",
        "short": "야에사쿠라",
        "imgs": ["27BFEB33597FDBC615", "21065333597FDBFB0F", "255DDB33597FDC2C09"],
        "texts": [
          "벚꽃마크 상태인 적이 공격시 40% 확률로 물리피해 80% 감소 / 동시에 공격자에게 1초간 기절 상태 부여 / 인반 폭격 피해 35% 증가",
          "일반 공격이 벚꽃마크 상태인 적에게 공격력 80% 에 해당하는 전기 원소피해를 입힌다 / 20% 확률로 주위 적에게 동일한 전기 원소피해를 입힌다 (충전, 분기 포함) (쿨타임 1초) / 인반이 입히는 모든 피해량 10% 증가.",
          "필드내 벚꽃마크 상태인 적 하나당 모든피해 7% 증가 최대 5중첩 / 인반 폭격률 5% 증가"
        ],
        "setTexts": [
          "전투중 HP상한 20% 증가 / 벚꽃마크 상태인 적에게 입히는 전기 원소피해 50% 증가",
          "엘리트 적을 처치시 자신의 HP30% 회복 (쿨타임 10초)"
        ]
      },
      "제레": {
        "oName": "제레",
        "one": "제레",
        "short": "제레",
        "imgs": ["2454CB33597FDBCA0B", "218FF133597FDBFE17", "214F3833597FDC2F1D"],
        "texts": [
          "전투중 SP상한이 150이상시 SP20 증가할때마다, 물리피해 6% 씩 증가 최대 6중첩",
          "전투중 SP상한이 150이상시 SP20 증가할때마다, 적에게 받는 물리피해 5%씩 감소 최대 6중첩",
          "전투중 SP상한이 150이상시 SP20 증가할때마다, 공격속도 4% 씩 증가 최대 6중첩"
        ],
        "setTexts": [
          "이동속도 30% 증가 / 피격시 근처 무작위 위치로 텔레포트 (쿨타임 10초)",
          "궁극기, 피해를 주는 무기 액티브 사용 후 3초간 남은 SP 비율에 따라 스킬피해 증가, 매 20% SP당 모든 피해 15% 증가"
        ]
      },
      "아인밴드": {
        "oName": "아인밴드",
        "one": "아밴",
        "short": "아인밴드",
        "imgs": ["21CA3833597FDBC514", "23487A33597FDBFA0A", "2228DB33597FDC2A1F"],
        "texts": [
          "전투를 도와주는 로봇을 소환 / 로봇이 큰 물리피해를 주는 레이져 공격 능력을 해제 / 필드상에 적이 2체 이하일때, 모든피해 25% 증가",
          "전투를 도와주는 로봇을 소환 / 로봇이 주위적을 넘어트리는 충격파 공격 능력을 해제 / 필드상에 적이 3체 이하일때, 매 6초마다 적하나를 띄워 3초 동안 시공봉인",
          "전투를 도와주는 로봇을 소환 / 로봇이 지속적으로 물리피해를 주는 광탄 공격 능력을 해제 / 필드상에 적이 4체 이하일때, 25% 확률로 피해 무효"
        ],
        "setTexts": [
          "로봇의 광탄, 충격파, 레이져 공격이 30% 확률로 2배 피해",
          "모든 발동 조건이 성립하지 않을때, 모든피해 15% 증가"
        ]
      },
      "수영복": {
        "oName": "수영복",
        "one": "수",
        "short": "수영복",
        "imgs": ["21826D33597FDBC419", "276A7533597FDBF819", "2669D833597FDC291B"],
        "texts": [
          "일반몹을 죽일시 팀원의 SP8 회복 / 엘리트 또는 보스를 죽일시 SP24 회복 / 매 발동마다 1개의 청량축복을 소비하며, 매 7초마다 1개씩 증가 (최대 3개) / 전투 시작시 청량축복을 모두 충전",
          "모든피해 18% 증가, 적을 공격시 4초 동안 적이 입는 모든피해 15% 증가 (쿨타임 8초)",
          "필드상의 팀원이 공격시 15% 확률로 적의 이동속도가 3초간 60% 감소 (쿨타임 10초) / 성흔의 효과는 중첩되지 않음"
        ],
        "setTexts": [
          "공격시 12% 확률로 하임왕을 소환하여 주위 적들을 넘어트리고 공격력 450%의 물리피해를 입힌다 (쿨타임 16초)",
          "하임왕이 출현할때 모든 팀원에게 (분신 포함) 화염 고리를 6초 동안 둘러 주위 적들에게 매 0.5초마다 893의 화염 원소피해를 입힌다"
        ]
      },
      "케플러": {
        "oName": "케플러",
        "one": "케",
        "short": "케플러",
        "imgs": ["277DA833597FDBCA08", "21AFCD33597FDBFF03", "22460633597FDC2F1E"],
        "texts": [
          "폭격시, 대상 주위 3m범위내의 적들에게 공격력의 200% 물리피해를 입힌다 (쿨타임 3초)",
          "폭격시, 대상 주위 3m범위내의 적들에게 2초간 마비 상태를 부여한다 (쿨타임 4초)",
          "폭격시, HP250 회복 (쿨타임 6초)"
        ],
        "setTexts": [
          "폭격피해 55% 증가",
          "보스가 아닌 적에게 폭격시 30초간 심판 상태를 부여하여 매 초 공격력의 15% 물리피해를 입힌다 (쿨타임 5초) / 필드상에 심판 상태인 적 하나당 자신의 폭격률 6% 증가 최대 5중첩"
        ]
      },

      // 시원한 여름날

      "장형": {
        "oName": "장형",
        "one": "장형",
        "short": "장형",
        "imgs": ["99DC853359AB4F0A2A", "99A3BA3359AB4F0A14", "9985413359AB4F0B22"],
        "texts": [
          "20콤보 이하시, 출장기가 아닌 모든 피해 25% 증가",
          "20콤보 이하시, 적에게 입는 물리피해 30% 감소",
          "20콤보 이하시, 극한 회피 후 2초동안 전기 원소피해 120% 증가"
        ],
        "setTexts": [
          "매 5초마다 자신 중심 3m내에 3개의 지진파를 생성 / 최초 2개의 지진파는 보스를 제외한 적들을 넘어트린다 / 세번째 지진파는 보스를 제외한 적들을 3초간 기절 시킨다",
          "필드상 적이 3 이상시, 모든 팀원의 물리피해 15% 증가, 폭격피해 25% 증가, 중복되지 않음."
        ]
      },
      "드큘": {
        "oName": "드라큘라",
        "one": "드",
        "short": "드큘",
        "imgs": ["99A70E3359AB4F0C28", "997EA93359AB4F0C2A", "9958523359AB4F0C14"],
        "texts": [
          "출혈 상태인 적에게 물리피해 40% 증가",
          "출혈 상태인 적을 적중시 자신의 HP, SP 3% 회복 (쿨타임 4초)",
          "필드상에 출혈 상태인 적하나당 자신의 공격속도 12% , 폭격률 4% 증가 최대 3중첩"
        ],
        "setTexts": [
          "적을 죽일시 60초동안 지속되는 권속을 소환 / 동시에 다른 권속의 지속시간을 갱신 / 권속은 적에게 공격력 50%의 물리피해를 입힌다 / 직접 피해를 받을시, 피해를 입힌 적을 타겟팅한다 / 필드상에 최대 3개의 권속만 존재 가능하며, 매 1개의 권속당 폭격피해가 15% 증가한다",
          "HP가 1% 이하시 5초 동안 회생 상태가 되어 입는 모든 피해가 100% 감소하고 움직이지 못하는 상태가 된다. / 매초 자신의 HP가 20%씩 회복되며, 회생상태가 끝날때 주위 적들을 날리고 5초간 출혈상태로 만들어 매초간 공격력 20%의 물리피해를 입힌다 (쿨타임 300초)"
        ]
      },
      "브로냐암영": {
        "oName": "브로냐 암영",
        "one": "브로냐암영",
        "short": "브로냐암영",
        "imgs": ["992B7D3359AB4F0D22", "998DE13359AB4F0D29", "9947D53359AB4F0D15"],
        "texts": [
          "일반 공격의 (충전, 분기 포함) 원거리 물리피해 38% 증가",
          "모든 팀원에게 단 하나만 적용되는 흑역결계를 씌워 모든 원거리피해를 20% 감소",
          "작은 범위의 암영필드가 3초후 생성되며, 암영필드내에서 공격속도가 35% 증가하고, 해당 필드를 벗어나면 사라짐"
        ],
        "setTexts": [
          "중화기의 충전 공격시, 간격이 1초 이하인 경우 다음 4초내 충전공격 피해량 15% 상승한다 / 피해량은 매 충전마다 중첩되며, 적용시간은 각각 계산된다. 최대 3중첩.",
          "브로냐 장비시, 폭격피해 60% 증가"
        ]
      },
      "신말": {
        "oName": "신 말",
        "one": "싱",
        "short": "신말",
        "imgs": ["9994663359AB4F0E2A", "9909D93359AB4F0E2F", "999B2B3359AB4F0E29"],
        "texts": [
          "은신 상태가 된 후 에너지를 축전한다. / 매 초마다 모든 피해량이 20% 증가하며 최대 3번 중첩된다. / 은신에서 벗어난 경우 4초후 효과가 사라짐",
          "은신에서 벗어난 경우 6초간, 모든 받는 피해량이 30% 감소",
          "은신 상태 돌입시 공격속도 25%와 폭격률 20% 상승 / 은신 상태 벗어난 뒤 6초 후 효과 초기화"
        ],
        "setTexts": [
          "은신 상태 진입시, 필드상 모든 적에게 공격력의 250%에 해당하는 물리 피해를 입힘",
          "은신 상태에서는 매 0.9초마다 자신의 HP, SP가 2%씩 회복"
        ]
      },
      "장광": {
        "oName": "나가미츠",
        "one": "장",
        "short": "장광",
        "imgs": ["9947A13359AB4F0B26", "99781D3359AB4F0B23", "99CB6F3359AB4F0B2D"],
        "texts": [
          "자신 주위에 역장을 형성, 역장에 적이 5초 이상 머무를 경우, 매 초마다 공격력의 150%에 해당하는 전기 원소피해를 입힌다. / 역장을 벗어나면 2초 후 사라짐",
          "자신 주위에 역장을 형성, 역장에 적이 5초 이상 머무를 경우, 적이 받는 전기 원소피해가 30%증가 / 역장을 벗어나면 2초 후 사라짐",
          "자신 주위에 역장을 형성, 역장에 적이 5초 이상 머무를 경우, 적이 입히는 모든 피해가 30% 감소 / 역장을 벗어나면 2초 후 사라짐"
        ],
        "setTexts": [
          "역장 내부에 5초 동안 적이 계속 있으면, 4초 동안 이동속도와 공격 속도를 20% 감소시킨다. (감속이 끝난 후 누적 시간을 초기화) / 적이 역장에서 벗어나면 2초 후 누적 시간이 초기화된다.",
          "역장 내부에 5초 동안 적이 계속 있으면, 2초 동안 빙결 상태로 만든다. (빙결이 끝난 후 누적 시간 초기화) / 적이 역장에서 벗어나면 2초 후 누적 시간이 초기화된다."
        ]
      },
      "피카소": {
        "oName": "피카소",
        "one": "피",
        "short": "피카소",
        "imgs": ["9988433359AB6FCD27", "9960A73359AB6FCD19", "9947273359AB6FCE1C"],
        "texts": [
          "적색 안료 제공 : 매 일반공격이 (충천, 분기 포함) 1단 충전 획득(쿨타임 1초) / 4단 충전 획득시 6초간 광열상태에 돌입하여 물리피해 32%증가, 지속시간 갱신 가능",
          "황색 안료 제공 : 매 일반공격이 (충천, 분기 포함) 1단 충전 획득(쿨타임 1초) / 4단 충전 획득시 6초간 보호상태에 돌입하여 적에게 직접 받는 물리피해 25% 감소 / 간접 받는 피해 40%감소, 지속시간 갱신 가능",
          "남색 안료 제공 : 매 일반공격이 (충천, 분기 포함) 1단 충전 획득(쿨타임 1초) / 4단 충전 획득시 6초간 펄스상태로 돌입하여 공격속도 20% 증가"
        ],
        "setTexts": [
          "일반공격(충전, 분기 포함)으로 매 1초 간격마다 / 적에게 가지고 있는 안료 중 하나를 칠한다. (지속 10초) / 안료는 매 3초마다 한번 바뀌며, 두개의 안료는 혼합되어 4초간 특수 효과가 발동됨. / 지속 시간동안 다른 생상을 칠할 수 없음 / 적 + 황 = 귤 : 대상이 입는 피해 25% 증가 / 적 + 남 = 자주 : 주위 적들에게 공격력의 120%에 해당하는 물리피해 / 황 + 남 = 녹 : 자신의 HP 4% 회복",
          ""
        ]
      },
      "오토": {
        "oName": "오토 아포칼립스",
        "one": "오",
        "short": "오토",
        "imgs": ["999A0D3359B697FE2D", "999F383359B697FE2A", "9955F03B5AEF0DEE03"],
        "texts": [
          "일반 공격(충천, 분기 미포함) 물리피해 35% 증가 / 매 일반공격이 1개의 중첩 획득 (0.8초 간격) / 3중첩시 다음 충전 공격의 모든피해 75% 증가",
          "일반 공격(충전, 분기 미포함) 피격된 적에게 / 4초간 쇠약상태 부여하여 공격력 30% 감소 (2초 쿨타임) /하나의 효과만 적용",
          "자신의 소환물이 있을때, 자신의 전기 원소피해 55% 증가"
        ],
        "setTexts": [
          "매 일반공격이 1개의 중첩 획득(0.8초 쿨타임) / 3중첩시 다음 충전 공격 적중시 적 반경 3m 역장을 4초간 생성 / 역장내의 적은 감전상태가 되어 받는 전기 원소피해가 40%상승 / 하나의 효과만 적용",
          "매 5초간격으로 한번 충전, 다음 충전공격 후 짧은 시간동안 피격된 적에게 창궁 표식을 부여, 0.5초 이후 터져 주위 적들에게 공격력의 80%에 해당하는 전기 원소피해를 입힘"
        ]
      },
      "송가": {
        "oName": "카렌 송가",
        "one": "송",
        "short": "송가",
        "imgs": ["99C8743359F49C8631", "99B5523359F49C8606", "99F3773359F49C8616"],
        "texts": [
          "자신 및 소환물의 물리피해가 20% 증가한다. / 취약 상태인 적에 대한 물리피해가 12% 증가한다.",
          "전투시 신의 은혜 보호막을 생성, 적에게 입는 피해가 400 만큼 감소한다.(해제시 재생성 쿨타임 6초) / 보호막이 있는 동안 받는 간접 물리피해가 30% 감소한다.",
          "필드 상 취약 상태인 적 한기당 자신의 공격속도 6% , 폭격피해 5% 가 증가한다. (최대 4중첩)"
        ],
        "setTexts": [
          "일회성으로 소모되는 SP가 15, 70, 125일시 자신의 팀원이 주는 모든 피해량이 각각 8%, 15%, 22% 증가한다. / 효과는 중첩되지 않는다.",
          "취약 상태인 적에게 공격을 적중시, 바로 HP 8%, SP 5%를 회복한다. (쿨타임 8초)"
        ]
      },
      "발키리슈트": {
        "oName": "발키리 슈트",
        "one": "발키리슈트",
        "short": "발키리슈트",
        "imgs": ["999E413359F49C8532", "9942C93359F49C8526", "99BFAE3359F49C851B"],
        "texts": [
          "극한 회피시 폭발을 일으켜 주변 적에게 공격력의 180% 에 해당하는 물리피해를 입힌다. (쿨타임 4초)",
          "현재 자신의 HP 비율이 적보다 낮을때, 입는 물리피해가 30% 감소한다.",
          "현재 자신의 HP 비율이 적보다 낮을때, 폭격 피해량이 50% 증가한다."
        ],
        "setTexts": [
          "극한회피 후 키아나 체술 쇼타임 돌입. 5초간 물리피해 45% 증가 / 분기공격 후 메이 다도 쇼타임 돌입. 5초간 매 초 HP 30 회복 / 피격 후 브로냐 사격 쇼타임 돌입. 5초간 입는 모든피해 30% 감소, 공격속도 25% 증가 / 각각의 쇼타임은 쿨타임을 공유한다.(쿨타임 10초)",
          "전투 중 HP 상한이 15 증가하며 폭격률이 10% 증가한다."
        ]
      },
      "비옥환": {
        "oName": "비옥환",
        "one": "비",
        "short": "비옥환",
        "imgs": ["99C72D335A1BC2091C", "9959D6335A1BC22B2B", "9953DA335A1BC26D37"],
        "texts": [
          "캐릭터 자신의 화염 원소피해 45%증가 / 일반공격(충전, 분기 포함)으로 적 쉴드 파괴시, 공격력 600의 비옥환을 소환하여 6초간 화염브레스 공격을 한다. / 화염브레스는 소환물 공격력의 320%만큼 화염피해를 입힌다. / 10초의 공유 쿨타임을 가진다.",
          "적에게 받는 물리피해 30% 감소 / 극한회피 후, 공격력 600의 비옥환을 소환하여 불기둥 공격을 한다. / 불기둥은 소환물 공격력의 500%만큼 화염피해를 입힌다. / 10초의 공유 쿨타임을 가진다.",
          "필드상에 점화상태인 적 한체당 공격속도 6% 씩 증가(최대 3중첩) / 주위에 적이 있는 경우, 적에게 매 초 공격력의 60%에 해당하는 화염피해를 입힌다."
        ],
        "setTexts": [
          "콤보에 비례하여 비옥환과 자신의 화염 원소피해량에 증가한다. (1콤보에 1% 최대 40콤보)",
          "전투 진입시, 만약 50콤보 이하시, 즉시 50콤보로 상승(쿨타임 30초) / 여우의 화염(2세트 효과)의 상한이 80콤보(80%)로 증가한다."
        ]
      },
      "시린": {
        "oName": "시린",
        "one": "시",
        "short": "시린",
        "imgs": ["99BF2C335A1BC20932", "99541F335A1BC22B0C", "99D1B8335A1BC26E12"],
        "texts": [
          "근접 물리피해 25% 증가, 체공상태적에게 20% 추가 증가.",
          "받은 원소피해 30% 감소, 자신이 상태이상시 20%로 무효.",
          "극한회피 후 1회 충전, 다음 공격 후 5초간 모든피해 35% 증가. / (쿨타임 1.5초)"
        ],
        "setTexts": [
          "메이 또는 사쿠라 장비시, 동일 대상을 지속적으로 공격시(2.5초간 공격을 하지 않을 경우 초기화) 매 공격당 폭격률 3%, 폭격피해 8% 증가 / 최대 중첩 수 5 (폭격률 15%, 폭격피해 40%)",
          "캐릭터가 등장 또는 HP60%이상시, 필드상의 적들이 주는 모든피해량를 15% 감소시키며, 입는 모든 피해량을 10% 증가시킨다. / 하나의 효과만 적용."
        ]
      },
      "메셸": {
        "oName": "메리 셸리",
        "one": "메",
        "short": "메셸",
        "imgs": ["993E52335A1BC20828", "998883335A1BC22B04", "993EC9335A1BC26D21"],
        "texts": [
          "전투 중 HP 15% 증가, 자신의 최대 HP 50%에 비례하는 물리피해가 추가된다. (쿨타임 3초)",
          "전투 중 HP 10% 증가, 전투 시작시 영혼의 방패를 얻고, 적에게 직접 공격당할경우, 자신의 최대 HP 25%에 비례하는 모든 피해를 막는다. / 방패는 파괴 후 30초 뒤 재생성 된다.",
          "전투 중 HP 10% 증가, 전투 상태에서 매 5초마다 모든 팀원이 40의 방어력을 얻는다. (5회 중첩) / 해당 효과는 게임이 끝날때까지 적용되며, 다른 효과와 중복되지 않는다."
        ],
        "setTexts": [
          "적이 가까이 있으면, 4초마다 자신을 중심으로 전류를 방출하여 적에게 자신의 최대 HP 40%에 비례하는 전기 원소피해를 주고 에너지 표식 한개를 얻는다.",
          "에너지 표식이 7개일 때, 보통공격(챠지, 분기 포함)으로 적을 공격시 프랑켄슈타인 상태가 되어, 자신이 주는 모든 피해가 40% 증가하며, 매 초마다 모든 팀원의 체력을 2%씩 회복시킨다. (10초 지속) / 프랑켄슈타인 상태가 끝나면, 모든 에너지 표식이 사라진다."
        ]
      },
      "테밴": {
        "oName": "테슬라 밴드",
        "one": "테",
        "short": "테밴",
        "imgs": ["99BF2A335A1BC20932", "996F34335A1BC22B08", "998302335A1BC26E01"],
        "texts": [
          "전장에 있지 않은 경우, 아군의 물리 데미지가 10% 강화된다 (한개의 효과만 적용). / 전장에 있는 경우, 자신의 물리 데미지와 공격속도가 25% 증가한다.",
          "전장에 있지 않은 경우, 아군의 전기 원소 피해 저항력이 40% 증가하고 전기 원소피해가 10% 증가한다 (한개의 효과만 적용). / 전장에 있는 경우, 자신이 적에게 직접 받는 물리 피해량이 25% 감소한다.",
          "전장에 있지 않은 경우, 아군의 이동속도가 10% 증가한다. (한개의 효과만 적용). / 전장에 있는 경우, 자신의 전기 원소 데미지가 35% 증가하고 이동속도가 10% 증가한다."
        ],
        "setTexts": [
          "일반공격(차지, 분기 포함)을 하면 코드를 1개 충전한다. (쿨타임 1초) / 코드 4개를 충전 하면 체인 라이트닝을 방출하여, 4기의 적을 공격하고 3초간 마비를 건다. / 첫번째 공격은 공격력의 600%인 전기 원소피해를 주고, 이후에 적이 맞을 때마다 전기 원소피해가 20% 감소한다. 체인 라이트닝은 한 목표를 여러번 공격하지 않는다. (쿨타임 12초)",
          "전투 중 HP 20% 증가, 자신의 전기 원소 피해량이 50% 증가, 체인 라이트닝의 피해 감소량이 20% 감소한다."
        ]
      },
      "슈밴": {
        "oName": "슈뢰딩거 밴드",
        "one": "슈",
        "short": "슈밴",
        "imgs": ["9993FA3A5A99FB5717", "99F6023A5A99FB5713", "99CB8F3A5A99FB571F"],
        "texts": [
          "공격마다(0.3초 간격) 물리피해 2% 증가, 7중첩시 5초간 격앙 상태 돌입 / 격앙 상태시 주는 모든피해 25% 증가 / 격앙 상태 해제시 중첩 초기화",
          "공격마다(0.3초 간격) 회심률 2% 증가, 7중첩시 5초간 격앙 상태 돌입 / 격앙 상태시 상태이상에 걸리지 않고 받는 모든 피해 15% 감소 / 격앙 상태 해제시 중첩 초기화",
          "공격마다(0.3초 간격) 공격속도 2% 증가, 7중첩시 5초간 격앙 상태 돌입 / 격앙 상태시 공격마다(0.3초 간격) SP 2 추가 회복 / 격앙 상태 해제시 중첩 초기화"
        ],
        "setTexts": [
          "격앙 상태 지속시간 2초 증가, 공격마다 얻는 효과 1% 증가",
          "빙결상태 적에게 주는 물리피해 20% 증가, 키아나 및 카렌 장비시 분기공격의 모든 피해 20% 증가"
        ]
      },
      "미켈": {
        "oName": "미켈란젤로",
        "one": "미",
        "short": "미켈",
        "imgs": ["9978ED3A5A99FB5618", "99E10A3A5A99FB5614", "99D9E83A5A99FB561D"],
        "texts": [
          "통상 공격마다(분기 및 차지 포함) 주는 물리피해 7.2% 증가 / 3초 지속, 5회 중첩, 중첩시 지속시간 초기화",
          "통상 공격마다(분기 및 차지 포함) 회심률 3% 증가 / 3초 지속, 5회 중첩, 중첩시 지속시간 초기화",
          "통상 공격마다(분기 및 차지 포함) 크리티컬 피해량 14% 증가 / 3초 지속, 5회 중첩, 중첩시 지속시간 초기화"
        ],
        "setTexts": [
          "주는 모든 피해 15% 증가 / 출격시 15초간 주는 모든피해 15% 증가(30초 간격)",
          "퇴장시, 10초간 초당 HP 2% 회복 / 출격시 모든 적에게 300% 물리피해를 입히고, 체력이 10% 이하인 적에게 추가로 300% 물리 피해를 입힘(30초 간격)"
        ]
      },
      "모네": {
        "oName": "모네",
        "one": "모",
        "short": "모네",
        "imgs": ["99E0AE4C5ADA94C911", "990D544C5ADA94C91E", "9989844C5ADA94C916"],
        "texts": [
          "적 공격시 번개 원소피해 30% 증가. 콤보당 모든피해 1% 증가(최대 15번 중첩)",
          "받는 모든피해 20% 감소. 콤보당, 번개 원소피해 2% 증가(최대 15번 중첩)",
          "매 10초마다 분기/차지공격 적중시, 적의 이동속도 60%를 6초간 감소. / 30 콤보 이상시, 공격속도 15% 증가"
        ],
        "setTexts": [
          "라이트닝 실드를 얻습니다. 실드가 있는동안 번개 원소피해가 30% 증가하며 피격시 0.3초간 직접 물리피해를 막아주고 소실. 실드는 15초 후 재생성",
          "감속효과가 대상 적의 3m 반경의 적에게도 30%만큼 적용됩니다. / 6초간 지속되며, 발동시 HP를 8% 회복"
        ]
      },
    },

    "token": {
      "클": "클레오",
      "클레오": "클레오",
      "클레오파트라": "클레오",
      "헌": "헌원",
      "희헌원": "헌원",
      "헌원": "헌원",
      "이이": "이이",
      "아인슈타인": "아인",
      "아인": "아인",
      "섹": "셰익",
      "셱": "셰익",
      "셐": "셰익",
      "섹스": "셰익",
      "셰익": "셰익",
      "세익": "셰익",
      "셰잌": "셰익",
      "세잌": "셰익",
      "복": "복희",
      "복히": "복희",
      "복희": "복희",
      "여": "여와",
      "여와": "여와",
      "여와와": "여와",
      "신농": "신농",
      "정": "정위",
      "정위": "정위",
      "정상위": "정위",
      "뉴": "뉴턴",
      "뉴턴": "뉴턴",
      "아이작": "뉴턴",
      "아이작 뉴턴": "뉴턴",
      "아이작뉴턴": "뉴턴",
      "철": "슈뢰딩거",
      "철수": "슈뢰딩거",
      "슈뢰": "슈뢰딩거",
      "슈뢰딩거": "슈뢰딩거",
      "막": "막스",
      "막스": "막스",
      "제": "제갈",
      "제갈": "제갈",
      "제갈량": "제갈",
      "흑": "흑헌원",
      "흑헌": "흑헌원",
      "흑헌원": "흑헌원",
      "이": "이홍",
      "홍": "이홍",
      "이홍": "이홍",
      "이이홍": "이홍",
      "이이 홍": "이홍",
      "서약": "카렌서약",
      "카렌 서약": "카렌서약",
      "카렌서약": "카렌서약",
      "유키무라": "유키무라",
      "지": "지크",
      "지크": "지크",
      "지크프리": "지크",
      "세": "세실",
      "세실": "세실",
      "세실리아": "세실",
      "예": "예카",
      "예카": "예카",
      "예가": "예카",
      "농": "노히메",
      "농희": "노히메",
      "노히메": "노히메",
      "노히매": "노히메",
      "사": "야에사쿠라",
      "야에": "야에사쿠라",
      "야에 사쿠라": "야에사쿠라",
      "야에사쿠라": "야에사쿠라",
      "사쿠라": "야에사쿠라",
      "아인밴": "아인밴드",
      "아인밴드": "아인밴드",
      "아인벤": "아인밴드",
      "아인벤드": "아인밴드",
      "아벤": "아인밴드",
      "아밴": "아인밴드",
      "수": "수영복",
      "수영": "수영복",
      "수영복": "수영복",
      "케": "케플러",
      "케플": "케플러",
      "케플러": "케플러",
      "장형": "장형",
      "드": "드큘",
      "드큘": "드큘",
      "드라큐라": "드큘",
      "드라큘라": "드큘",
      "브로냐암영": "브로냐암영",
      "싱": "신말",
      "신": "신말",
      "신말": "신말",
      "싱말": "신말",
      "신 말": "신말",
      "싱 말": "신말",
      "장": "장광",
      "장광": "장광",
      "나가미츠": "장광",
      "피": "피카소",
      "피카소": "피카소",
      "오": "오토",
      "오토": "오토",
      "오토 아포칼립스": "오토",
      "오토아포칼립스": "오토",
      "송": "송가",
      "송가": "송가",
      "발키리슈트": "발키리슈트",
      "발키리 슈트": "발키리슈트",
      "비": "비옥환",
      "비옥": "비옥환",
      "비옥환": "비옥환",
      "시": "시린",
      "시린": "시린",
      "메": "메셸",
      "메셀": "메셸",
      "메셸": "메셸",
      "메리셀리": "메셸",
      "메리셸리": "메셸",
      "메리 셀리": "메셸",
      "메리 셸리": "메셸",
      "테": "테밴",
      "테밴": "테밴",
      "태밴": "테밴",
      "테벤": "테밴",
      "태벤": "테밴",
      "테슬밴드": "테밴",
      "테슬라밴드": "테밴",
      "테슬라 밴드": "테밴",
      "슈": "슈밴",
      "슈밴": "슈밴",
      "슈벤": "슈밴",
      "철밴": "슈밴",
      "슈뢰밴드": "슈밴",
      "슈뢰딩거밴드": "슈밴",
      "슈뢰딩거 밴드": "슈밴",
      "미": "미켈",
      "미켈": "미켈",
      "모": "모네",
      "모네": "모네",
      "모내": "모네",
    },
    "exception": {
      "철막이": "철수막스이이",
      "정막이": "정위막스이이",
      "막섹아": "막스세익아인",
      "수메": "수영복 중",
      "수메이": "수영복 중",
      "수메중": "수영복 중",
      "수영복 메이": "수영복 중",
      "비홍 하이퍼 모드": "발키리슈트 하",
      "비홍하이퍼모드": "발키리슈트 하",
      "비홍 하이퍼모드": "발키리슈트 하",
      "황매화 실드 모드": "발키리슈트 중",
      "황매화실드모드": "발키리슈트 중",
      "황매화 실드모드": "발키리슈트 중",
      "백련 버스트 모드": "발키리슈트 상",
      "백련버스트모드": "발키리슈트 상",
      "백련 버스트모드": "발키리슈트 상",
    }
  }


export default stigma4