const weapon = {
    "후부키": {
      "oName": "영도·사쿠라 후부키",
      "type": "태도",
      "short": "후부키",
      "img": "99478F3359B23B8B03",
      "spec": "공격 289 회심 29",
      "skill": "[SP소모:15][쿨타임:12초] 전방으로 돌진하여 적에게 공격력의 400.0%인 물리피해를 주고, 비앵표식이 있는 적을 3.5초간 기절시킵니다,역신무녀 장비시, 맞은 적에게 비앵표식을 추가합니다.",
      "passive": "공격시 100.0% 확률로 전방에 검기를 날려, 공격력의 200% + 1920의 물리피해를 줍니다, 검기의 쿨타임 4.8초 / 역신무녀 장비시, 검기에 맞은 적은 비앵스택을 하나 얻고, 인반 명중시, 검기의 쿨타임이 초기화 됩니다 / (비앵스택3개=비앵표식)"
    },
    "써드": {
      "oName": "3rd 성유물",
      "type": "태도",
      "short": "써드",
      "img": "99FCB13359B23B893E",
      "spec": "공격 254 회심 59",
      "skill": "",
      "passive": "20, 50, 100콤보 이상일 때 각각 물리 대미지 20%, 30%, 40% 상승 / 폭발 상태에서 물리 대미지 30% 상승"
    },
    "null": {
      "oName": "",
      "type": "",
      "short": "",
      "img": "",
      "spec": "",
      "skill": "",
      "passive": ""
    },
    "token": {
      "써드": "써드",
      "3rd": "써드",
      "3RD": "써드",
      "후붘": "후부키",
      "후부키": "후부키",
    }
  }


export default weapon