const weapon_greatsword = {
  "data": {
    "흑헌검": {
      "oName": "흑헌원 검",
      "type": "대검",
      "short": "흑헌검",
      "img": "999CB33359B247F323",
      "spec": "공격 250 회심 25",
      "skill": "[SP 소모 : 22][쿨타임 : 25초] 8초 동안 물리 대미지가 35% 상승하며 지속 시간 내에 첫 번째로 적을 쓰러뜨린 순간 8초 동안 지속되는 시공 단열을 발동 시키고, 시공 단열이 끝날 때까지 대미지 상승효과가 유지된다.",
      "passive": "공격 명중 시 4.5초 동안 유지되는 시공 단열을 발동한다. 쿨타임 60초"
    },
    "우귀절": {
      "oName": "우귀절·나가미츠",
      "type": "대검",
      "short": "우귀절",
      "img": "99D5BF3359B247F20D",
      "spec": "공격 289 회심 17",
      "skill": "",
      "passive": "돌진하며 에너지를 축적한다, 돌진 지속 시간이 0.5초, 1.5초, 3초를 채우면 가장 먼저 대시 공격에 맞은 적을 중심으로 폭발이 발생한다, 각각 공격력의 400%, 600%, 800%의 물리 대미지를 입힌다. / 콤보 수가 5 이하일 때, 물리 대미지 32.0% 상승"
    },
    "발뭉": {
      "oName": "발뭉",
      "type": "대검",
      "short": "발뭉",
      "img": "99179B3359B247F10B",
      "spec": "공격 285 회심 32",
      "skill": "[SP 소모 : 20][쿨타임 : 25초] 8초 동안 캐릭터의 물리 대미지가 25.0% 상승하며 모든 극의참이 강화 극의참으로 변한다.",
      "passive": "적 공격 시 전방으로 극의참을 날려, 공격력의 80%의 물리 대미지를 입힌다. 15% 확률로 강화된 극의참이 발동되며 공격력의 160%의 물리 대미지를 입힌다. 극의참은 최소 0.8초가 경과해야 발동된다."
    },
    "데우스대검": {
      "oName": "데우스 대검",
      "type": "대검",
      "short": "데우스대검",
      "img": "99F18F3359B247F302",
      "spec": "공격 234 회심 28",
      "skill": "[SP 소모 : 24][쿨타임 : 18초] 전방의 작은 범위에 레이저를 난사하여 주변을 태운다. 맞은 적을 폭발시키며, 주변 적에게 717의 화염 대미지를 입히고 연소 상태로 만들어 3초 동안 0.5초마다 89의 화염 대미지를 입힌다.",
      "passive": "공격 시 95의 화염 대미지 추가"
    },
    "배반자대검": {
      "oName": "배반자 대검",
      "type": "대검",
      "short": "배반자대검",
      "img": "99DDC73359B247F117",
      "spec": "공격 245 회심 15",
      "skill": "[SP 소모 : 18][쿨타임 : 12초] 6개의 추적 미사일을 연속으로 발사하여 각각 타깃과 작은 범위 내의 적에게 공격력의 200% 의 물리 대미지를 입히고 2.50초 동안 기절 상태로 만든다.",
      "passive": "피격 시 50% 확률로 타깃에게 공격력의 160%의 물리 대미지를 입힌다."
    },
    "7th": {
      "oName": "7th 성유물",
      "type": "대검",
      "short": "7th",
      "img": "99C1A53359B247F01D",
      "spec": "공격 263 회심 48",
      "skill": "[SP 소모 : 18][쿨타임 : 24초] 검기를 2회 연속 발사하여 적에게 공격력의 최대 8*25% 의 물리 대미지를 입힌다. 검기는 십자로 교차하는 경우 폭발하며 공격력의 350% 의 물리 대미지를 입히고 6.00초 동안 적을 기절 상태로 만든다.",
      "passive": "기절 상태의 적 공격 시 4초 동안 공격 속도 50.0% 상승. 쿨타임 12초"
    },
    "선혈": {
      "oName": "선혈의 춤",
      "type": "대검",
      "short": "선혈",
      "img": "9923003359B247F208",
      "spec": "공격 289 회심 17",
      "skill": "[SP 소모 : 20][쿨타임 : 15초] 참격으로 선혈의 토네이도를 만들어 적에게 날린다. 공격력의 9*35% 의 물리 대미지를 입히며 9.00초 동안 적을 레이지 상태로 만든다, 레이지 상태 동안 적의 공격 속도는 두 배가 되고, 받는 원소 대미지가 60% 상승한다.",
      "passive": "15콤보 이상일 때 물리 대미지 30% 상승. 대기 중 HP 수치가 50% 이하일 때, 0.5초마다 HP를 30.0 회복한다."
    },
    "질소결정검": {
      "oName": "질소 결정검",
      "type": "대검",
      "short": "질소결정검",
      "img": "99BFAC3359B2480E1F",
      "spec": "공격 168 회심 31",
      "skill": "",
      "passive": "공격 시 8.0% 확률로 적을 2.15초 동안 빙결 상태로 만든다."
    },
    "어썰트": {
      "oName": "초중량 검·어썰트",
      "type": "대검",
      "short": "어썰트",
      "img": "99CC1B3359B2480E1D",
      "spec": "공격 183 회심 10",
      "skill": "[SP 소모 : 15][쿨타임 : 8초] 바닥을 쳐서 충격파를 방출하여 경로상의 적을 띄우고 공격력의 450% 물리 대미지를 입힌다.",
      "passive": ""
    },
    "전리공진검": {
      "oName": "전리 공진검",
      "type": "대검",
      "short": "전리공진검",
      "img": "9987A63359B2480D2A",
      "spec": "공격 171 회심 27",
      "skill": "[SP 소모 : 15][쿨타임 : 10초] 검을 들어 이온 에너지를 방출하여 작은 범위 내의 적에게 공격력의 3*750의 전격 대미지를 입히고 2초 동안 마비 상태로 만든다.",
      "passive": ""
    },
 },
  "token_rev": {
    "흑헌검": ["흑헌검", "흑헌원검", "흑헌원 검"],
    "우귀절": ["우귀절"],
    "발뭉": ["발뭉"],
    "데우스대검": ["데우스대검", "천부대검", "웬디대검", "왠디대검", "대우스대검", "데우스 대검"],
    "배반자대검": ["배반자대검", "쿠로냐대검", "쿠로나대검", "배반자 대검"],
    "7th": ["7th", "칠쓰", "칠스", "세븐쓰", "세븐스", "성유물의수치"],
    "선혈": ["선혈", "선혈의춤", "선혈의 춤"],
    "여명심판": ["여명심판"],
    "질소결정검": ["질소결정검", "빙결대검"],
    "어썰트": ["어썰트", "체공대검"],
    "전리공진검": ["전리공진검", "마비대검"],
  }
}

export default weapon_greatsword