const weapon_longsword = {
  "data": {
    "히오스": {
      "oName": "허무의 칼날",
      "type": "태도",
      "short": "히오스",
      "img": "997D573359B23B8D44",
      "spec": "공격 267 회심 43",
      "skill": "[SP 소모 : 15][쿨타임 : 20초] 6.00초 동안 자신을 따라 이동하는 시공 단열의 영역을 만들어낸다. 지속 시간 동안 기본 공격(분기와 차지 공격 포함)의 크리티컬률이 30.0% 상승한다.",
      "passive": "한 번에 SP를 10, 40, 70 소모 시 8초 동안 물리 대미지가 15%, 30%, 45% 상승한다. (중첩 불가)"
    },
    "와호장룡": {
      "oName": "와호장룡",
      "type": "태도",
      "short": "와호장룡",
      "img": "996E9E3359B23B8C1F",
      "spec": "공격 287 회심 27",
      "skill": "",
      "passive": "극한 회피 성공 시 전자기 충전 상태가 되어 5초 이내에 명중한 첫 공격에 충전된 전자기를 소모하여 적에게 4,000의 전격 대미지와 4,000의 물리 대미지를 입힌다. 충전된 전자기를 소비하면 1.5초 동안 다시 획득할 수 없다. / 공격 시 8.0% 확률로 타깃과 주변의 적을 3초 동안 마비 상태로 만든다. 쿨타임 6초"
    },
    "빙담천": {
      "oName": "방영도·빙담천",
      "type": "태도",
      "short": "빙담천",
      "img": "991FB13359B23B8B0B",
      "spec": "공격 265 회심 46",
      "skill": "[SP 소모 : 20][쿨타임 : 18초] 자신의 발 아래 반경 3.5미터 범위에 극한의 구역을 만들어 10.0초 동안 구역내의 아군의 빙결 대미지가 40.0% 상승한다. 극한 구역내에 6초 후 폭발하는 극한 시한폭탄을 설치하여, 폭발 시 적에게 981의 빙결 대미지를 입힌다.",
      "passive": "원소 대미지가 15.0% 상승한다. 5초마다 차지하며 다음 공격 시 반경 5미터 이내의 적들에게 1,260의 빙결 대미지를 입힌다. / 현신화·물망초가 사용할 경우, 추가로 KP를 200을 회복한다."
    },
    "실반": {
      "oName": "요정검·실반",
      "type": "태도",
      "short": "실반",
      "img": "99C1273359B23B8C10",
      "spec": "공격 275 회심 36",
      "skill": "[SP 소모 : 17][쿨타임 : 38초] 결계를 펼쳐, 20초 동안 결계 안쪽의 파티 멤버의 공격 속도 25% 상승, 이동 속도 20% 상승 및 공격 시 모든 대미지를 10% 상승시킨다.",
      "passive": "캐릭터의 이동 속도 상승에 따라 캐릭터가 공격으로 입히는 모든 대미지를 상승시킨다, 이동 속도 10%마다 모든 대미지 5.0% 상승(최대 50%) / 캐릭터의 이동 속도를 30% 상승시킨다."
    },
    "후부키": {
      "oName": "영도·사쿠라 후부키",
      "type": "태도",
      "short": "후부키",
      "img": "99478F3359B23B8B03",
      "spec": "공격 289 회심 29",
      "skill": "[SP소모:15][쿨타임:12초] 전방으로 돌진하여 적에게 공격력의 400.0%인 물리피해를 주고, 비앵표식이 있는 적을 3.5초간 기절시킵니다,역신무녀 장비시, 맞은 적에게 비앵표식을 추가합니다.",
      "passive": "공격시 100.0% 확률로 전방에 검기를 날려, 공격력의 200% + 1920의 물리피해를 줍니다, 검기의 쿨타임 4.8초 / 역신무녀 장비시, 검기에 맞은 적은 비앵스택을 하나 얻고, 인반 명중시, 검기의 쿨타임이 초기화 됩니다 / (비앵스택3개=비앵표식)"
    },
    "폭식절도": {
      "oName": "폭식 절도",
      "type": "태도",
      "short": "폭식절도",
      "img": "9911323359B23B8D04",
      "spec": "공격 239 회심 22",
      "skill": "[SP 소모 : 18][쿨타임 : 15초] 칼날 바람을 날려 경로상의 적들을 경직시키고 자신의 앞으로 끌어당기며 1.50초 동안 기절 상태로 만든다. 지속 시간 동안 계속해서 타격당 448의 물리 대미지를 입힌다.",
      "passive": "적을 쓰러뜨리면 파티원 전원의 SP 4 회복"
    },
    "써드": {
      "oName": "3rd 성유물",
      "type": "태도",
      "short": "써드",
      "img": "99FCB13359B23B893E",
      "spec": "공격 254 회심 59",
      "skill": "",
      "passive": "20, 50, 100콤보 이상일 때 각각 물리 대미지 20%, 30%, 40% 상승 / 폭발 상태에서 물리 대미지 30% 상승"
    },
    "질풍태도": {
      "oName": "질풍 태도",
      "type": "태도",
      "short": "질풍태도",
      "img": "9924AF3359B23B8C2E",
      "spec": "공격 224 회심 39",
      "skill": "[SP 소모 : 20][쿨타임 : 25초] 토네이도를 발생시켜 경로상의 적들을 공중에 띄우고, 다단 히트로 타격당 224의 빙결 대미지를 입히며1.80초 동안 공격 속도와 이동 속도를 80% 감소시킨다.",
      "passive": "공격 시 5.0% 확률로 4.5초 동안 이동 속도 100% 상승. 쿨타임 10초"
    },
    "뇌절": {
      "oName": "뇌절",
      "type": "태도",
      "short": "뇌절",
      "img": "99B63D3359B23B8A3C",
      "spec": "공격 265 회심 46",
      "skill": "[SP 소모 : 18][쿨타임 : 25초] 전장의 모든 아군(분신 포함)과 소환물 주위에 영체의 칼날을 소환하여 보호한다. 방어력이 50% 상승하고 칼날에 닿은 적에게 0.25초마다 320의 전격 대미지를 입힌다. 지속 시간 6.00초",
      "passive": "직접 및 간접 피해(연소, 출혈 등)를 받을 때, 40% 확률로 받는 피해 600 감소"
    },
    "빠따": {
      "oName": "마그네틱 스톰·참",
      "type": "태도",
      "short": "빠따",
      "img": "99D54B3359B23B8C0D",
      "spec": "공격 298 회심 6",
      "skill": "[SP 소모 : 20][쿨타임 : 15초] 돌진하면서 자기 폭풍을 두 번 발생시켜 적을 쓸어버린다. 1회당 1,920의 전격 대미지를 입히며 2.50초 동안 마비 상태로 만든다.",
      "passive": "전격 대미지 40% 상승"
    },
    "빙빙바": {
      "oName": "영도·플라즈마",
      "type": "태도",
      "short": "빙빙바",
      "img": "99D54B3359B23B8C0D",
      "spec": "공격 269 회심 18",
      "skill": "[SP 소모 : 20][쿨타임 : 25초] 플라즈마 에너지로 한기를 방출하여 경로상의 적을 결정체로 봉인하고 빙결 상태로 만들어 5.00초 동안 0.9초마다 880의 빙결 대미지를 입힌다.",
      "passive": "공격 시 24의 빙결 대미지가 추가된다."
    },
    "우후서언": {
      "oName": "우후서언",
      "type": "태도",
      "short": "우후서언",
      "img": "9988B23359F48B5A24",
      "spec": "공격력 287 회심 29",
      "skill": "[SP 소모 : 16][쿨타임 : 18초] 펼쳐진 우산이 흔들거리면서 나아가 주변에 얼음 결정을 흩날린다. 대규모 범위로 적에게 최대 공격력의 24*30.0% 빙결 원소 대미지를 입히고 공격 속도와 이동 속도를 40% 감소시킨다. 지속 시간 5.00초",
      "passive": "이동 속도가 감속된 적에게 주는 물리 대미지 20.0%"
    },
    "지장어혼": {
      "oName": "지장어혼",
      "type": "태도",
      "short": "지장어혼",
      "img": "999C103359F48B5A0D",
      "spec": "공격력 289 회심 24",
      "skill": "[SP소모 : 10][쿨타임 : 9초] 전투를 도와주는 지장어혼을 39초동안 소환, 어혼이 소환될때 주위 적들을 띄우고 공격력 300%의 물리피해를 입힌다. / 어혼은 다음과 같은 공격을 한다. / 베기공격, 공격력 100%의 물리피해 / 찌르기공격, 공격력 200%의 물리피해를 입히고 적중된 적을 날린다. / 내려찍기 공격, 공격력 100%의 물리피해를 입히고 적을 띄운다.",
      "passive": "체공된 적에게 입히는 모든피해 32% 증가"
    },
    "캔디검": {
      "oName": "아이쨩 지팡이",
      "type": "태도",
      "short": "캔디검",
      "img": "99B3DA485ADB177F20",
      "spec": "공격력: 221 회심: 26",
      "skill": "",
      "passive": "크리티컬시 세개의 진저맨을 앞에 떨어트리고, 잠시 후 폭발하여 공격력의 150.0%인 물리피해를 줍니다, 쿨타임 8초 / 10 콤보를 넘으면, 원소피해가 15.0% 증가합니다"
    },
    "캔디검": {
      "oName": "아이쨩 지팡이",
      "type": "태도",
      "short": "캔디검",
      "img": "99B3DA485ADB177F20",
      "spec": "공격력: 221 회심: 26",
      "skill": "",
      "passive": "크리티컬시 세개의 진저맨을 앞에 떨어트리고, 잠시 후 폭발하여 공격력의 150.0%인 물리피해를 줍니다, 쿨타임 8초 / 10 콤보를 넘으면, 원소피해가 15.0% 증가합니다"
    },
    "아카조메": {
      "oName": "요도 아카조메 사쿠라",
      "type": "태도",
      "short": "아카조메",
      "img": "995A804B5A46EF0B22",
      "spec": "공격력: 287 회심: 31",
      "skill": "[SP소모:20][쿨타임:21초] 주변의 적을 베어 공격력의 500%인 화염 원소피해를 줍니다. 스킬 사용중 무적. 마지막 일격에 맞은 적은 추가로 공격력의 200%인 화염 원소피해를 입습니다. 이 후, 캐릭터는 5초동안 한번의 공격을 완벽히 무시합니다. / 진염행혼이 장비하면, 스킬을 맞은 적이 받는 화염 원소피해가 25% 증가, 적이 받는 얼음과 전기 원소피해가 10% 증가합니다. 15초 지속.(분기 효과와 중복되지 않습니다)",
      "passive": "캐릭터의 공격이 주는 화염 원소피해가 40% 증가합니다"
    },
    "역날검": {
      "oName": "역날 결정검",
      "type": "태도",
      "short": "역날검",
      "img": "99BD8E3359B23B6B18",
      "spec": "공격 169 회심 29",
      "skill": "[SP 소모 : 10][쿨타임 : 18초] 결정 에너지를 방출하여 작은 범위의 적들을 결정에 봉인하고 4.00초 동안 빙결 상태로 만든다.",
      "passive": ""
    },
    "황검": {
      "oName": "황검",
      "type": "태도",
      "short": "황검",
      "img": "9924FC3359B23B6F08",
      "spec": "공격 158 회심 25",
      "skill": "",
      "passive": "공격 시 화염 대미지를 36 추가한다. 파티에 키아나가 있다면, 자신이 주는 화염 대미지가 18% 상승한다."
    },
    "피카츄검": {
      "oName": "묘도·뇌혼",
      "type": "태도",
      "short": "피카츄검",
      "img": "994C553359B23B6C2C",
      "spec": "공격 163 회심 38",
      "skill": "",
      "passive": "공격 시 43의 전격 대미지를 추가한다."
    },
    "고주파절단도": {
      "oName": "고주파 절단도",
      "type": "태도",
      "short": "고주파절단도",
      "img": "9912FC3359B23B8A0E",
      "spec": "공격 272 회심 38",
      "skill": "[SP 소모 : 14][쿨타임 : 11초] / 타깃을 향해 순간 이동하여 작은 범위에 구속 역장을 건다. 역장에 구속된 적은 4초 동안 방어력이 80% 감소하고 0.4초마다 234의 전격 대미지를 받는다.",
      "passive": "크리티컬 시 50.0% 확률로 타깃을 공중에 띄우고 3초간 시공 봉인 상태로 만든다. 쿨타임 6.00초"
    },

  },
  "token_rev": {
    "히오스": ["허칼", "허무의칼", "허무의 칼", "허무의 칼날", "히오스", "히오스칼"],
    "와호장룡": ["와호장룡", "ㅘ호장룡", "ㅘ!호장룡", "와!호장룡"],
    "빙담천": ["빙담", "넹담", "빙담천", "넹담천", "수담천", "방영도 빙담천"],
    "실반": ["실반", "요정검", "실반칼", "실반검"],
    "후부키": ["후붘", "후부키", "후붕큡"],
    "폭식절도": ["돼지칼", "폭식칼", "폭식절도", "폭식 절도"],
    "써드": ["써드", "서드", "삼검", "3rd", "3RD"],
    "질풍태도": ["웬디칼", "왠디칼", "질풍칼", "질풍태도", "질풍 태도"],
    "뇌절": ["뇌절"],
    "빠따": ["빠따", "네틱참", "비틱참", "스톰참", "마그네틱", "마그네틱참", "마그네틱 스톰참"],
    "빙빙바": ["빙빙바", "영도플라즈마", "영도 플라즈마"],
    "우후서언": ["우후서언", "우후", "우산검", "우산칼", "우산"],
    "지장어혼": ["지장어혼"],
    "캔디검": ["캔디검", "캔디칼", "아이짱지팡이", "아이쨩지팡이", "아이짱 지팡이", "아이쨩 지팡이"],
    "아카조메": ["아카조메", "아카조매", "요도아카조메", "요도 아카조메"],
    "역날검": ["역날", "역날검", "역날결정검", "역날 결정검", "빙결검", "빙결칼"],
    "황검": ["황검"],
    "피카츄검": ["피카츄", "피카추", "피카츄검", "피카추검", "피카츄칼", "피카추칼", "묘도", "묘도뇌혼", "묘도 뇌혼"],
    "고주파절단도": ["*.*주파\\s*.*단도"]
  }
}


// 제외

// 반역장 태도11식, 여와검, 개천검, 프로토 펄스 태도, 열에너지 절단검,
// 단앵, 뇌폭, 헌원·펄스 태도, 엔도직 블레이드, 묘도·뇌요,
// 합금·폭식 절도, 펄스 태도 17식, 펄스 태도 19식,
// 합금·질풍 태도, 복합도·주작, 복합도·버들, 요도 무라마사

export default weapon_longsword