const weapon_longsword = {
  "data": {
    "히오스": {
      "oName": "허무의 칼날",
      "type": "태도",
      "short": "히오스",
      "img": "997D573359B23B8D44",
      "spec": "공격 267 회심 43",
      "skill": "[SP 소모 : 15][쿨타임 : 20초] 6.00초 동안 자신을 따라 이동하는 시공 단열의 영역을 만들어낸다. 지속 시간 동안 기본 공격(분기와 차지 공격 포함)의 크리티컬률이 30.0% 상승한다.",
      "passive": "한 번에 SP를 10, 40, 70 소모 시 8초 동안 물리 대미지가 15%, 30%, 45% 상승한다. (중첩 불가)"
    },
    "와호장룡": {
      "oName": "와호장룡",
      "type": "태도",
      "short": "와호장룡",
      "img": "996E9E3359B23B8C1F",
      "spec": "공격 287 회심 27",
      "skill": "",
      "passive": "극한 회피 성공 시 전자기 충전 상태가 되어 5초 이내에 명중한 첫 공격에 충전된 전자기를 소모하여 적에게 4,000의 전격 대미지와 4,000의 물리 대미지를 입힌다. 충전된 전자기를 소비하면 1.5초 동안 다시 획득할 수 없다. / 공격 시 8.0% 확률로 타깃과 주변의 적을 3초 동안 마비 상태로 만든다. 쿨타임 6초"
    },
    "빙담천": {
      "oName": "방영도·빙담천",
      "type": "태도",
      "short": "빙담천",
      "img": "991FB13359B23B8B0B",
      "spec": "공격 265 회심 46",
      "skill": "[SP 소모 : 20][쿨타임 : 18초] 자신의 발 아래 반경 3.5미터 범위에 극한의 구역을 만들어 10.0초 동안 구역내의 아군의 빙결 대미지가 40.0% 상승한다. 극한 구역내에 6초 후 폭발하는 극한 시한폭탄을 설치하여, 폭발 시 적에게 981의 빙결 대미지를 입힌다.",
      "passive": "원소 대미지가 15.0% 상승한다. 5초마다 차지하며 다음 공격 시 반경 5미터 이내의 적들에게 1,260의 빙결 대미지를 입힌다. / 현신화·물망초가 사용할 경우, 추가로 KP를 200을 회복한다."
    },
    "실반": {
      "oName": "요정검·실반",
      "type": "태도",
      "short": "실반",
      "img": "99C1273359B23B8C10",
      "spec": "공격 275 회심 36",
      "skill": "[SP 소모 : 17][쿨타임 : 38초] 결계를 펼쳐, 20초 동안 결계 안쪽의 파티 멤버의 공격 속도 25% 상승, 이동 속도 20% 상승 및 공격 시 모든 대미지를 10% 상승시킨다.",
      "passive": "캐릭터의 이동 속도 상승에 따라 캐릭터가 공격으로 입히는 모든 대미지를 상승시킨다, 이동 속도 10%마다 모든 대미지 5.0% 상승(최대 50%) / 캐릭터의 이동 속도를 30% 상승시킨다."
    },
    "후부키": {
      "oName": "영도·사쿠라 후부키",
      "type": "태도",
      "short": "후부키",
      "img": "99478F3359B23B8B03",
      "spec": "공격 289 회심 29",
      "skill": "[SP소모:15][쿨타임:12초] 전방으로 돌진하여 적에게 공격력의 400.0%인 물리피해를 주고, 비앵표식이 있는 적을 3.5초간 기절시킵니다,역신무녀 장비시, 맞은 적에게 비앵표식을 추가합니다.",
      "passive": "공격시 100.0% 확률로 전방에 검기를 날려, 공격력의 200% + 1920의 물리피해를 줍니다, 검기의 쿨타임 4.8초 / 역신무녀 장비시, 검기에 맞은 적은 비앵스택을 하나 얻고, 인반 명중시, 검기의 쿨타임이 초기화 됩니다 / (비앵스택3개=비앵표식)"
    },
    "폭식절도": {
      "oName": "폭식 절도",
      "type": "태도",
      "short": "폭식절도",
      "img": "9911323359B23B8D04",
      "spec": "공격 239 회심 22",
      "skill": "[SP 소모 : 18][쿨타임 : 15초] 칼날 바람을 날려 경로상의 적들을 경직시키고 자신의 앞으로 끌어당기며 1.50초 동안 기절 상태로 만든다. 지속 시간 동안 계속해서 타격당 448의 물리 대미지를 입힌다.",
      "passive": "적을 쓰러뜨리면 파티원 전원의 SP 4 회복"
    },
    "써드": {
      "oName": "3rd 성유물",
      "type": "태도",
      "short": "써드",
      "img": "99FCB13359B23B893E",
      "spec": "공격 254 회심 59",
      "skill": "",
      "passive": "20, 50, 100콤보 이상일 때 각각 물리 대미지 20%, 30%, 40% 상승 / 폭발 상태에서 물리 대미지 30% 상승"
    },
    "질풍태도": {
      "oName": "질풍 태도",
      "type": "태도",
      "short": "질풍태도",
      "img": "9924AF3359B23B8C2E",
      "spec": "공격 224 회심 39",
      "skill": "[SP 소모 : 20][쿨타임 : 25초] 토네이도를 발생시켜 경로상의 적들을 공중에 띄우고, 다단 히트로 타격당 224의 빙결 대미지를 입히며1.80초 동안 공격 속도와 이동 속도를 80% 감소시킨다.",
      "passive": "공격 시 5.0% 확률로 4.5초 동안 이동 속도 100% 상승. 쿨타임 10초"
    },
    "고주파절단도": {
      "oName": "고주파 절단도",
      "type": "태도",
      "short": "고주파절단도",
      "img": "9912FC3359B23B8A0E",
      "spec": "공격 272 회심 38",
      "skill": "[SP 소모 : 14][쿨타임 : 11초] / 타깃을 향해 순간 이동하여 작은 범위에 구속 역장을 건다. 역장에 구속된 적은 4초 동안 방어력이 80% 감소하고 0.4초마다 234의 전격 대미지를 받는다.",
      "passive": "크리티컬 시 50.0% 확률로 타깃을 공중에 띄우고 3초간 시공 봉인 상태로 만든다. 쿨타임 6.00초"
    },

  },
  "token_rev": {
    "히오스": ["허칼", "허무의칼", "허무의 칼", "허무의 칼날", "히오스", "히오스칼"],
    "와호장룡": ["와호장룡", "ㅘ호장룡", "ㅘ!호장룡", "와!호장룡"],
    "빙담천": ["빙담", "넹담", "빙담천", "넹담천", "수담천"],
    "실반": ["실반", "요정검", "실반칼", "실반검"],
    "후부키": ["후붘", "후부키", "후붕큡"],
    "폭식절도": ["돼지칼", "폭식칼", "폭식절도", "폭식 절도"],
    "써드": ["써드", "서드", "삼검", "3rd", "3RD"],
    "질풍태도": ["웬디칼", "왠디칼", "질풍칼", "질풍태도", "질풍 태도"],
    "고주파절단도": ["*.*주파\\s*.*단도"]
  }
}


// 제외

// 반역장 태도11식, 여와검, 개천검, 프로토 펄스 태도, 열에너지 절단검,
// 단앵, 뇌폭, 헌원·펄스 태도, 엔도직 블레이드, 묘도·뇌요,
// 합금·폭식 절도, 펄스 태도 17식, 펄스 태도 19식,
// 합금·질풍 태도, 복합도·주작, 복합도·버들, 요도 무라마사

export default weapon_longsword