const weapon_handgun = {
  "data": {
    "콜트": {
      "oName": "콜트 피스 메이커",
      "type": "쌍권총",
      "short": "콜트",
      "img": "9903B33359B21D1203",
      "spec": "공격 72 회심 17",
      "skill": "[SP 소모 : 7][쿨타임 : 12초] 타깃과 그 주변의 적들을 2.54초 동안 기절 상태로 만든다.",
      "passive": ""
    },
    "달신": {
      "oName": "달신의 가호",
      "type": "쌍권총",
      "short": "달신",
      "img": "99FA5A3359B21D9114",
      "spec": "공격 117 회심 21",
      "skill": "[SP 소모 : 12][쿨타임 : 12초] 타깃 주변의 적을 띄우고 3.08초 동안 시공 봉인 상태로 만든다.",
      "passive": ""
    },
    "물요1": {
      "oName": "물의 요정 Ⅰ형",
      "type": "쌍권총",
      "short": "물요1형",
      "img": "99B59C3359B21D9223",
      "spec": "공격 113 회심 28",
      "skill": "",
      "passive": "공중에 뜬 상태의 적 공격 시 물리 대미지 31% 상승"
    },
    "물요2": {
      "oName": "물의 요정 Ⅱ형",
      "type": "쌍권총",
      "short": "물요2형",
      "img": "99D73A3359B21D921B",
      "spec": "공격 117 회심 21",
      "skill": "[SP 소모 : 9][쿨타임 : 13초] 결빙탄을 발사하여 전방 부채꼴 범위 내에 들어온 적들을 2.85초 동안 빙결 상태로 만든다.",
      "passive": ""
    },

    "빛그": {
      "oName": "빛과 그림자",
      "type": "쌍권총",
      "short": "빛그",
      "img": "999DAF3359B21D5F20",
      "spec": "공격 270 회심 39",
      "skill": "[SP 소모 : 20][쿨타임 : 20초] / 얼음 구체를 발사하여 적을 밀어내고 마지막에 폭발하며 넓은 범위의 적을 4.00초 동안 빙결 상태로 만들고 0.9초마다 850의 빙결 대미지를 입힌다.",
      "passive": "기본 공격(분기와 차지 공격 포함)으로 실드를 파괴하면 한기를 방출하여 4.00초 동안 타깃과 그 주변 적의 이동 속도와 공격 속도를 84% 감소"
    },
    "신농총": {
      "oName": "신농의 가호",
      "type": "쌍권총",
      "short": "신농총",
      "img": "99C5B53359B21D6015",
      "spec": "공격 285 회심 22",
      "skill": "[SP 소모:20][쿨타임:20초]결계를 펼쳐 10.00초 동안 타깃(Boss는 무효)을 허약 상태로 만들고 공격력을 70% 감소시키며, 타깃 이외의 적들은 시간 정지가 상태가 되며 받는 피해가 대폭 감소한다.",
      "passive": "허약 상태의 적에게 모든 대미지 50% 상승"
    },
    "정위총": {
      "oName": "정위의 날개",
      "type": "쌍권총",
      "short": "정위총",
      "img": "99B46F3359B21D601A",
      "spec": "공격 259 회심 30",
      "skill": "[SP 소모:30][쿨타임:25초] 하늘에서 불타는 유성이 12초 동안 계속 떨어지며 무작위로 적을 덮쳐 공격력의 90% 의 물리 대미지를 입히며 폭발하고 연소 상태로 만들어 1.5초 동안 0.5초마다 97의 화염 대미지를 입힌다.",
      "passive": "동일 타깃을 공격 시(2.5초 내로 공격하지 않으면 초기화), 공격할 때마다 크리티컬률이 2.0%, 크리티컬 대미지가 5.0%씩 상승하며 각각 최대 20%, 50%까지 상승시킬 수 있다."
    },
    "탬버린": {
      "oName": "에너지 트랜스퍼",
      "type": "쌍권총",
      "short": "탬버린",
      "img": "9991123359B21D6021",
      "spec": "공격 276 회심 32",
      "skill": "[SP 소모 : 14][쿨타임 : 16초] 후방으로 순간 이동하며 원래 있던 자리에 기절 탄 하나를 설치한다. 기절 탄은 폭발하며 공격력의 350% 의 물리 대미지를 입히고 4.50초 동안 지속하는 기절 역장을 만든다.",
      "passive": "시공 단열에 들어가면, 4초 동안 자신의 공격 속도가 80.0%, 크리티컬률이 25.0% 상승한다. 시공 단열이 끝나면 효과는 사라진다."
    },
    "귀각": {
      "oName": "뇌도·귀각",
      "type": "쌍권총",
      "short": "귀각",
      "img": "99551D3359B21D5F2E",
      "spec": "공격 264 회심 47",
      "skill": "[SP 소모 : 16][쿨타임 : 25초] 타깃에게 붙는 도깨비 불을 발사하여 8.00초 동안 0.5초마다 타깃과 주변의 적에게 640의 전격 대미지를 입힌다.",
      "passive": "공격 시 추가로 30%의 전격 대미지를 입힌다. 폭발 상태에서 적 공격 시 감전 상태로 만들고, 7초 동안 적의 받는 전격 대미지를 60.0% 상승시킨다."
    },
    "요활": {
      "oName": "요정의 활·오리진",
      "type": "쌍권총",
      "short": "요활",
      "img": "99A1DE3359C6FC0F21",
      "spec": "공격 279 회심 35 ",
      "skill": "[SP 소모 : 18][쿨타임 : 0초]풍압탄을 발사한다. 직선상의 모든 적에게 공격력의 110%의 물리 대미지를 두 번 입힌다. 만약 풍압탄을 맞은 적중에 출혈 상태의 적이 포함되어 있다면 자신의 SP를 10 회복시킨다.",
      "passive": "이동 속도 25% 상승, 공격 속도 25% 상승"
    },
    "헬활": {
      "oName": "이형·헬의 활",
      "type": "쌍권총",
      "short": "헬활",
      "img": "9908284B5A46EF0C2F",
      "spec": "공격 279 회심 35 ",
      "skill": "[SP 소모 : 16][쿨타임 : 15초] 타깃을 향해 레이저 포격을 가해 범위 내의 적에게 공격력의 60.0%*9 물리 대미지를 입히고 5.00초 동안 빙결 상태로 만든다.",
      "passive": "  크리티컬률이 5.0% 상승하며, 기절 또는 빙결 상태의 적 공격 시 입히는 물리 대미지가 40.0% 상승한다."
    },
    "세컨": {
      "oName": "2nd 성유물",
      "type": "쌍권총",
      "short": "세컨",
      "img": "998DAF3359B21D5F23",
      "spec": "공격 254 회심 59",
      "skill": "",
      "passive": "공격으로 얻는 SP 회복 속도 35% 상승 /   공격 시 50의 전격 대미지를 추가한다."
    },
    "토르": {
      "oName": "토르의 망치",
      "type": "쌍권총",
      "short": "토르",
      "img": "9937E33359B21D6128",
      "spec": "공격 298 회심 6",
      "skill": "[SP 소모 : 18][쿨타임 : 13초] 번개의 망치로 적을 내리쳐 공격력의 405% 의 물리 대미지를 입히며 4.00초 동안 적을 쇠약 상태로 만들고 방어력을 80% 감소시킨다.",
      "passive": "크리티컬률 15% 상승"
    },
    "초전자": {
      "oName": "초전자 핸드건",
      "type": "쌍권총",
      "short": "초전자",
      "img": "997A493359B21D6119",
      "spec": "공격 287 회심 19",
      "skill": "[SP 소모 : 16][쿨타임 : 18초] 넓은 범위의 적에게 2,300의 전격 대미지를 입히고 4.00초 동안 마비 상태로 만든다.",
      "passive": "공격 시 3.0% 확률로 2.50초 동안 적을 마비 상태로 만들어, 공격과 이동을 막는다."
    },
    "샤마시": {
      "oName": "샤마시의 심판",
      "type": "쌍권총",
      "short": "샤마시",
      "img": "997BEB3359F48B5B31",
      "spec": "공격력: 260 회심: 45",
      "skill": "[SP소모:20[쿨타임:35초] 전방을 향해 샤마시의 심판의 힘을 폭발시켜, 공격력의 100% + 2*1984인 화염피해를 주고, 적의 이동속도와 공격속도를 30% 감소하고, 받는 모든 피해가 15% 증가하며, 매 초마다 936의 화염피해가 10% 확률로 적을 2.5초간 기절시킵니다. 15초 지속. 해방하는 동안, 캐릭터는 모든 피해에 80% 면역입니다: 해방 후, 캐릭터는 매 초마다 최대 HP의 13%를 잃습니다, 5초 지속. 캐릭터는 이 효과로 사망하지 않습니다: 현재 HP가 33% 이하인 경우, 이 스킬을 사용할 수 없습니다.",
      "passive": "주변의 적에게 매 초마다 10% 확률로 연소를 걸어, 0.5초마다 301의 화염피해를 줍니다, 3.5초 지속: 연소된 적에게 주는 모든 피해가 18% 증가합니다"
    },
    "웬디총": {
      "oName": "허리케인 리볼버",
      "type": "쌍권총",
      "short": "웬디총",
      "img": "99B39C3359B21D620B",
      "spec": "공격 224 회심 39",
      "skill": "[SP 소모 : 24][쿨타임 : 30초] 자신을 중심으로 장시간 회전하며 다수의 적을 베어 가른다. 회전 중 이동할 수 있으며 한 번 벨 때마다 174의 빙결 대미지를 입히고, 마무리 폭발은 공격력의 300% 의 물리 대미지를 입히며 1.50초간 적을 60% 감속시킨다.",
      "passive": "공격 시 5.0% 확률로 4.5초 동안 이동 속도 100% 상승. 쿨타임 10초"
    },
    "데우스총": {
      "oName": "지배자의 권총",
      "type": "쌍권총",
      "short": "데우스총",
      "img": "996FEC3359B21D6129",
      "spec": "공격 244 회심 16",
      "skill": "[SP 소모:25][쿨타임:10초] 강력한 기동력으로 어퍼컷을 날려 주변 적에게 다단 히트로 타격당 공격력의 40%의 물리 대미지를 입히고 연소 상태로 만들어 2.10초 동안 0.5초마다 149의 화염 대미지를 입힌다.",
      "passive": "공격 시 25의 화염 대미지가 추가된다."
    },
  },
  "token": {
    "콜트": "콜트",
    "콜트 피스메이커": "콜트",
    "스턴총": "콜트",
    "달신": "달신",
    "달신의 가호": "달신",
    "히오스총": "달신",
    "물요1": "물요1",
    "물요1형": "물요1",
    "물요": "물요2",
    "물요2": "물요2",
    "물요2형": "물요2",
    "빛그": "빛그",
    "빛과그림자": "빛그",
    "빛과 그림자": "빛그",
    "신농총": "신농총",
    "정위총": "정위총",
    "꼬장총": "정위총",
    "꼬짱총": "정위총",
    "꼬쨩총": "정위총",
    "정위의날개": "정위총",
    "정위의 날개": "정위총",
    "탬버린": "탬버린",
    "템버린": "탬버린",
    "트랜스퍼": "탬버린",
    "에너지트랜스퍼": "탬버린",
    "에너지 트랜스퍼": "탬버린",
    "귀각": "귀각",
    "뇌도귀각": "귀각",
    "뇌도 귀각": "귀각",
    "요활": "요활",
    "요정의활": "요활",
    "요정의 활": "요활",
    "오리진": "요활",
    "헬활": "헬활",
    "핼활": "헬활",
    "헬의활": "헬활",
    "헬의 활": "헬활",
    "이형헬의활": "헬활",
    "이형 헬의활": "헬활",
    "이형 헬의 활": "헬활",
    "세컨": "세컨",
    "쎄컨": "세컨",
    "세컨드": "세컨",
    "쎄컨드": "세컨",
    "2nd": "세컨",
    "2ND": "세컨",
    "2nd성유물": "세컨",
    "2nd 성유물": "세컨",
    "투쓰": "세컨",
    "토르": "토르",
    "톨망": "토르",
    "토르의망치": "토르",
    "토르의 망치": "토르",
    "마비총": "초전자",
    "초전자": "초전자",
    "초전자핸드건": "초전자",
    "초전자 핸드건": "초전자",
    "샤마시": "샤마시",
    "사마시": "샤마시",
    "샤마시심판": "샤마시",
    "샤마시 심판": "샤마시",
    "샤마시의심판": "샤마시",
    "샤마시의 심판": "샤마시",
    "웬디총": "웬디총",
    "왠디총": "웬디총",
    "허리케인리볼버": "웬디총",
    "허리케인 리볼버": "웬디총",
    "데우스총": "데우스총",
    "대우스총": "데우스총",
    "데우스권총": "데우스총",
    "천부총": "데우스총",
    "천부권총": "데우스총",
    "지배자의권총": "데우스총",
    "지배자의 권총": "데우스총",
  }
}

// 제외

// 화염 궤멸자, 영총 야에, 파프닐
// 모신나강 태양, 타오르는 날개, 헌원 펄스 권총, 다크니스 핸드건, 봉총,
// 성총 카렌, 불의 요정 1형, 불의 요정 2형, 합금 허리케인 리볼버, 합금 지배자의 권총
// 프로토 펄스 권총, 개량형 콜트 아나콘다, 개량형 USP, M1911, 데저트 이글

export default weapon_handgun