const weapon_cannon = {
  "data": {
    "별섬": {
      "oName": "행성 파괴자 19C",
      "type": "중화기",
      "short": "별섬",
      "img": "9999A23359B2811524",
      "spec": "공격 283 회심 31",
      "skill": "[SP 소모 : 25][쿨타임 : 12초] 타깃을 향해 산탄포를 조준하여 18발의 산탄형 포탄을 발사한다. 1발당 공격력의 75.0%의 물리 대미지를 입히며 맞은 적을 띄우고, 연소 상태로 만들어 4초 동안, 0.5초마다 600의 화염 대미지를 입힌다.",
      "passive": "다수의 타깃을 조준하여 미사일을 발사한다. 차지가 비교적 길며, 동일한 적에게 많이 맞으면 위력이 조금 줄어든다. 차지 1단 : 2발, 2단 : 5발, 3단 : 11발 / 미사일 또는 산탄포를 사용해서 적의 뒤를 공격하면 공격마다 추가로 400의 화염 대미지를 입힌다."
    },
    "델타": {
      "oName": "코어 집속포 Delta",
      "type": "중화기",
      "short": "델타",
      "img": "99718A3359B2492E35",
      "spec": "공격 282 회심 26",
      "skill": "[SP 소모 : 20][쿨타임 : 20초] 전방으로 느리게 나가는 에너지 구체를 발사한다. 경로상의 적에게 다단 히트로 타격당 640의 전격 대미지를 입히며 3.60초 동안 마비 상태로 만든다.",
      "passive": "무기를 발사하여 직선상의 타겟에게 지속적인 대미지를 입힌다. 일정 시간이 지나면 오버히트 상태가 된다. / 레이저 코어에 가까울수록 대미지가 커지고 3미터 이내의 적에게 최대 대미지를 준다. / 마비 상태의 적에게 주는 모든 대미지가 16% 상승한다."
    },
    "치우": {
      "oName": "치우의 대포",
      "type": "중화기",
      "short": "치우",
      "img": "99F86C3359B2492F1B",
      "spec": "공격 294 회심 11",
      "skill": "[SP 소모:25][쿨타임:20초] 극저온의 진동파를 방출하여 주변의 적을 검은 얼음에 봉인한다. 봉인당한 적을 빙결 상태로 만들어 4초 동안 0.9초마다 960의 빙결 원소 대미지를 입히며, 스킬을 발동한 자의 HP를 100 회복시킨다.",
      "passive": "무기를 발사하여 직선상의 타겟에게 지속적인 대미지를 입힌다. 일정 시간이 지나면 오버히트 상태가 된다. / 레이저 코어에 가까울수록 대미지가 커지고 3미터 이내의 적에게 최대 대미지를 준다. / 마비 상태의 적에게 주는 모든 대미지가 16% 상승한다."
    },
    "양파": {
      "oName": "양자 파괴자 Ⅱ형",
      "type": "중화기",
      "short": "양파",
      "img": "99E5203359B2492D1A",
      "spec": "공격 280 회심 27",
      "skill": "[SP 소모 : 20][쿨타임 : 20초] 후방으로 순간 이동하며 원래 자리에 짧은 시간 동안 블랙홀을 열어 적을 끌어당김과 동시에 6초 동안 지속하는 감속 역장을 생성한다. 역장내에 있는 적은 이동 속도가 60% 감소하고, 0.6초마다 188의 빙결 대미지를 받는다.",
      "passive": "무기를 발사하여 직선상의 타깃에게 지속적인 대미지를 입힌다. 일정 시간이 지나면 오버히트 상태가 된다. / 레이저 코어에 가까울수록 대미지가 커지고 3미터 이내의 적에게 최대 대미지를 준다. / 시공 감속 상태의 적에 대해 자신의 물리 대미지가 35% 상승한다."
    },
    "사나다": {
      "oName": "화도·사나다",
      "type": "중화기",
      "short": "사나다",
      "img": "99FC163359B249301A",
      "spec": "공격 275 회심 34",
      "skill": "[SP 소모 : 20][쿨타임 : 120초] 12.00초 동안 공격 속도가 100% 상승한다.",
      "passive": "다수의 타깃을 조준하여 미사일을 발사한다. 차지가 비교적 길며, 동일한 적에게 많이 맞으면 위력이 조금 줄어든다. 차지 1단 : 3발, 2단 : 7발, 3단 : 15발. / 미사일 명중 시 추가로 56의 화염 대미지를 입히며, 시간차로 폭발을 일으켜 490의 범위 화염 대미지를 입힌다."
    },
    "티르": {
      "oName": "티르의 잘린 팔",
      "type": "중화기",
      "short": "티르",
      "img": "99BA403359B2492F27",
      "spec": "공격 282 회심 26",
      "skill": "[SP 소모 : 19][쿨타임 : 9초] 3단 차지 포격을 발사한다. 포격에 명중한 적을 출혈 상태로 만들고, 7초 동안 0.5초마다 315의 물리 대미지를 입힌다.",
      "passive": "축적포, 1단 : 포탄 한 개, 2단 : 강력한 포탄 두 개, 3단 : 초강력 포탄 세 개. / 기본 공격과 차지 공격으로 엘리트 실드가 파괴된 적에게 주는 물리 대미지가 30% 상승한다."
    },
    "쿠로냐포": {
      "oName": "잠복자의 캐넌",
      "type": "중화기",
      "short": "쿠로냐포",
      "img": "99465D3359B2492E05",
      "spec": "공격 234 회심 28",
      "skill": "[SP 소모 : 18][쿨타임 : 12초] 기계 팔로 지면을 내려쳐 다수의 진동 탄을 쏜다. / 타격당 공격력의 120% 의 물리 대미지를 입히고 2.55초 동안 기절 상태로 만든다. 스킬 발동 후 잠시 이동 속도가 상승한다.",
      "passive": "축적포, 1단 : 포탄 한 개, 2단 : 강력한 포탄 두 개, 3단 : 초강력 포탄 세 개"
    },
    "돼지빔": {
      "oName": "잠식의 캐넌",
      "type": "중화기",
      "short": "돼지빔",
      "img": "9946A13359B2492D05",
      "spec": "공격 239 회심 22",
      "skill": "[SP 소모:25][쿨타임:20초] 기계 팔로 지면을 내려쳐 충격파를 발생시킨다, 충격파는 여러 번 폭발하며 적을 넉백시키며 타격당 214의 화염 대미지를 입히고 연소 상태로 만들어 4초 동안 0.5초당 134의 화염 대미지를 입힌다. 스킬 발동 후 잠시 이동 속도가 상승한다",
      "passive": "무기를 발사하여 직선상의 타깃에 지속적인 대미지를 입힌다. 일정 시간이 지나면 오버히트 상태가 된다. / 레이저 코어에 가까울수록 대미지가 커지고 3미터 이내의 적에게 최대 대미지를 준다."
    },
    "오쓰": {
      "oName": "5th 성유물",
      "type": "중화기",
      "short": "오쓰",
      "img": "99C76D3359B2492C21",
      "spec": "공격 254 회심 59",
      "skill": "",
      "passive": "축적포, 1단 : 포탄 한 개, 2단 : 강력한 포탄 두 개, 3단 : 초강력 포탄 세 개. 15콤보 이상일 때, 물리 대미지가 20% 상승한다. / 포탄 폭발 시 차지 단계에 따라 2, 4, 9개의 미니 유탄이 생기며 유탄 하나당 공격력의 30%의 물리 대미지를 준다."
    },
    "헤카톤": {
      "oName": "헤카톤케일·프로토타입",
      "type": "중화기",
      "short": "헤카톤",
      "img": "99750D3359B2492F36",
      "spec": "공격 298 회심 6",
      "skill": "[SP 소모 : 18][쿨타임 : 24초] 전방에 구역 시공 트랩을 설치하여 6.20초 동안 구역 내의 적을 시공 감속 상태로 만들고 방어력을 50% 감소시킨다.",
      "passive": "다수의 타깃을 조준하여 미사일을 발사한다. 차지가 비교적 길며, 동일한 적에게 많이 맞으면 위력이 조금 줄어든다. 차지 1단 : 3발, 2단 : 7발, 3단 : 15발. / 미사일 명중 시 10% 확률로 랜덤하게 2초 동안 기절/마비/빙결 상태로 만들며 추가로 1,333의 화염/전격/빙결 대미지를 입힌다."
    },
    "개틀링": {
      "oName": "M134 발칸",
      "type": "중화기",
      "short": "개틀링",
      "img": "995D2E4A5ADA94C927",
      "spec": "공격 281 회심 35",
      "skill": "[SP 소모 : 5][쿨타임 : 15초] 10초간 폭격률을 10% 폭격 피해를 25% 증가되며, 과열되지 않는다. 하지만 지속되는 매 초마다 최대체력의 2%를 잃는다.",
      "passive": "속사무기, 직선상의 적에게 피해를 주며, 계속 공격시 과열 상태가 됩니다, 목표가 캐릭터와 가까울 수록 더 큰 피해를 줍니다, 거리가 3m 이하인 경우 최대피해: 차지공격 크리티컬시 목표 주위에 소규모 폭발을 일으켜 주변 적에게 공격력의 50%인 물리피해를 줍니다. 최소발동간격 0.3초"
    },
    "복희의서": {
      "oName": "복희의 서",
      "type": "중화기",
      "short": "복희의서",
      "img": "990742495AF2A62C11",
      "spec": "공격력: 272 회심: 38",
      "skill": "[SP소모:6][쿨타임:8초] 불, 번개, 얼음의 세 원소 형태로 변형 / 불: 화염구슬을 차징하여 발사. 맞은 적에게 점화를 걸어, 0.5초마다 400의 화염 원소피해. 6초 지속 / 번개: 유도형 번개구슬을 차징하여 발사. 적중시 15.0%의 확률로 공격력의 150%인 전기 원소피해를 추가로 주고, 쇠약상태로 만들어 방어력을 60% 감소. 3초 지속 / 얼음: 얼음을 빔으로 발사. 맞은 적은 이동속도와 공격속도가 50% 감소. 3초 지속 2.0% 확률로 적을 얼림. 3초 지속",
      "passive": "점화, 쇠약, 슬로우, 빙결상태인 적에게 주는 모든 피해가 20.0% 증가"
    },
    "단오포": {
      "oName": "떡이파리 쇠뇌",
      "type": "중화기",
      "short": "단오포",
      "img": "991EA6395B25CB9C02",
      "spec": "공격 231 회심 10",
      "skill": "",
      "passive": "경량화포, 차지시간이 짧음. 통상공격의 모든 피해 30% 감소. / 1차지 : 단발 화포 2차지 : 2발 강력 화포 3차지 : 3발 초강력 화포 / 2차지와 3차지 공격 명중시 대상 이동 및 공격속도 7초간 40% 감소 / 모든 팀원이 감속된 적을 공격시, HP 25회복 (쿨타임 : 5초)"
    },
    "요르문": {
      "oName": "X-01푸른 눈의 요르문간드",
      "type": "중화기",
      "short": "요르문",
      "img": "99A46C3359B2491222",
      "spec": "공격 178 회심 17",
      "skill": "[SP 소모 : 12][쿨타임 : 20초] 6.50초 동안 자신이 공격한 적의 이동 속도와 공격 속도를 60% 감소시킨다. 효과 지속 시간 : 3.5초",
      "passive": "다수의 타깃을 지정해서 미사일을 발사한다. 차지 시간이 길거나, 동일한 타깃에 여러 발 명중 시 대미지가 조금 약해진다. / 차지 1단 : 3발, 2단 : 7발, 3단 : 15발"
    },
    "마르코프": {
      "oName": "마르코프 A형",
      "type": "중화기",
      "short": "마르코프",
      "img": "99A3F13359B2491322",
      "spec": "공격 163 회심 38",
      "skill": "",
      "passive": "축적포, 1단 : 포탄 한 개, 2단 : 강력한 포탄 두 개, 3단 : 초강력 포탄 세 개 / 공격 시 60% 확률로 적을 연소 상대로 만들어 4.10초 동안 0.5초마다 150의 대미지를 입힌다."
    },
    "음극자포": {
      "oName": "음극자포 07식",
      "type": "중화기",
      "short": "음극자포",
      "img": "99B0E63359B249141E",
      "spec": "공격 188 회심 3",
      "skill": "[SP 소모:7][쿨타임:20초] 8초 동안 주변의 적들의 이동 속도와 공격 속도를 80% 감소시킨다.",
      "passive": "무기를 발사하여 직선상의 타깃에 지속적인 대미지를 입힌다. 일정 시간이 지나면 오버히트 상태가 된다. / 레이저 코어에 가까울수록 대미지가 커지고 3미터 이내의 적에게 최대 대미지를 준다."
    },
    "에덴의별": {
      "oName": "에덴의 별",
      "type": "중화기",
      "short": "에덴의별",
      "img": "Weapon_Cannon_B28_194_4",
      "spec": "공격 268 회심 36",
      "skill": "",
      "passive": "축적포, 1단 : 포탄 한 개, 2단 : 강력한 포탄 두 개, 3단 : 초강력 포탄 세 개 / 3단 축적포의 마지막 발이 명중하면, 20% 확률로 기절 3.5초 / 3단 축적포의 마지막 발이 명중하면, 600의 물리데미지를 추가로 주고, 0.5초 후 주변에 (자신은 제외) 200의 물리 데미지를 준다. / 레이드 퀘스트에서 크리티컬 데미지 +20%, 회심률 + 3.0%"
    },
 },
  "token_rev": {
    "별섬": ["별섬", "행파", "19C", "19c", "행성파괴자", "행성 파괴자"],
    "델타": ["델타", "Delta", "delta"],
    "치우": ["치우", "치우포", "킹우", "킹갓포"],
    "양파": ["양파", "양파빔", "양파코인", "양자 파괴자", "양자파괴자"],
    "사나다": ["사나다", "화도 사나다", "화도사나다"],
    "티르": ["티르", "티잘팔", "티르의 잘린 팔"],
    "쿠로냐포": ["쿠로냐포", "급식포", "잠복자", "잠복자의 캐넌", "잠복자의캐넌"],
    "돼지빔": ["돼지빔", "잠식", "잠식의 캐넌", "잠식의캐넌"],
    "오쓰": ["오쓰", "오스", "핍쓰", "핍스", "5th", "5th 성유물"],
    "헤카톤": ["헤카톤", "핵깡통", "헤깡통", "깡통", "헤카톤케일"],
    "개틀링": ["개틀링", "게틀링", "발칸", "M134"],
    "복희의서": ["복희의서", "복희의 서"],
    "단오포": ["단오포", "떡쇠", "보우건", "쇠뇌", "떡이파리 쇠뇌", "떡이파리쇠뇌"],
    "요르문": ["요르문", "황르문", "요르문간드", "황르문간드", "킹르문간드"],
    "마르코프": ["마르코프"],
    "음극자포": ["음극자포"],
    "에덴의별": ["에덴의별", "에덴의 별"],
  }
}

export default weapon_cannon