const weapon_holycross = {
  "data": {
    "유다": {
      "oName": "유다의 서약",
      "type": "십자가",
      "short": "유다",
      "img": "9977E33359B248621D",
      "spec": "공격 276 회심 32",
      "skill": "[SP 소모 : 16][쿨타임 : 13초] 십자가를 설치하여 전개한다. 6초 동안 주변 적을 속박하고 13개의 빛의 창을 발사한다. 무작위로 타깃에게 떨어지며 각각 공격력의 282% 전기 대미지를 준다.",
      "passive": "공격이 적에게 명중하면 20.0%의 확률로 6초 동안 적에게 성스러운 빛의 표식을 새긴다. 표식이 새겨진 적은 피격마다 650의 전격 대미지를 입게 된다. 쿨타임 13초"
    },
    "짭다": {
      "oName": "모조된 유다·피의 포옹",
      "type": "십자가",
      "short": "짭다",
      "img": "99AE193359B2486113",
      "spec": "공격 265 회심 46",
      "skill": "[SP 소모 : 24][쿨타임 : 10초] 십자가를 설치하여 전개한다. 주변의 적을 공중에 띄운 후, 2초 동안 0.25초마다 한 번씩 벤다. 띄우기와 하단 참격은 각각 공격력의 200.0% 의 물리 대미지를 입히고, 참격은 적을 출혈 상태로 만들어 0.5초마다 760의 물리 대미지를 입힌다. 지속 시간 5초",
      "passive": "출혈 상태의 적 공격 시 물리 대미지 40.0% 상승"
    },
    "샄다": {
      "oName": "벚꽃의 서약",
      "type": "십자가",
      "short": "샄다",
      "img": "994DC73359B2486125",
      "spec": "공격 265 회심 46",
      "skill": "[SP 소모 : 20][쿨타임 : 12초] 십자가를 설치하여 전개한다. 붉은 벚꽃 검을 3.5초동안 사출하여 매 0.3초마다 범위내 적에게 참격을 가해 공격력의 179.7%의 물리피해를 입힌다. 그리고 21.2% 확률로 붉은 벚꽃마크 1회를 추가한다. 적에게 3개의 벚꽃마크 카운트를 쌓을시 10초동안 지속되는 벚꽃마크를 새긴다.",
      "passive": "적에게 공격을 적중시 59.9% 확률로 목표 중심으로 벚꽃참을 가하여 공격력의 199.5%에 해당하는 물리피해를 입힌다. 적이 벚꽃마크 상태일때 2440 화염 원소피해를 추가로 입힌다. 쿨타임 6초 / 앵화윤무가 장비시, 벚꽃참이 적에게 붉은 벚꽃 마크 카운트 1개를 추가한다."
    },
    "11쓰": {
      "oName": "11th 성유물",
      "type": "십자가",
      "short": "11쓰",
      "img": "9971A23359F48B5D03",
      "spec": "공격 274 회심 41",
      "skill": "[SP 소모 : 12][쿨타임 : 13초] 십자가를 설치하여 전개한다. 10초 동안 주위 아군의 폭격률을 10% 증가, 매 초마다 무작위 적을 향해 검의 비를 내린다. 적 주위 작은범위에 5x50% 물리피해를 입힌다.",
      "passive": "취약 상태인 적을 공격시 39.9% 확률로 모든 팀원의 체력을 74만큼 회복시킨다. 쿨타임 3초"
    },
    "엘류드니르": {
      "oName": "엘류드니르",
      "type": "십자가",
      "short": "엘류드니르",
      "img": "996B804B5A46EF0A1F",
      "spec": "공격 275 회심 36",
      "skill": "[SP 소모 : 20][쿨타임 : 18초] 십자가를 설치하여 전개한다. 10초 동안 1.5초마다 무작위 적에게 광탄을 발사하여 일정 범위에 135%의 물리 피해를 주고 넘어트린다. 30% 확률로 적을 2초간 기절시킨다.",
      "passive": "기절 상태의 적에게 주는 모든 데미지가 20% 상승한다."
    },
    "레인저십자가": {
      "oName": "레인저 십자가",
      "type": "십자가",
      "short": "레인저십자가",
      "img": "99D4CA395B25CB9C17",
      "spec": "공격 240 회심 20",
      "skill": "[SP 소모 : 15][쿨타임 : 15초] 심자가 전개시 8초간 0.75초 간격으로 무작위 적에게 화염고리를 발사하여 5*233의 화염 원소 피해를 입히고, 연소시켜 3초간 0.5초 간격으로 80 화염 원소 피해를 입힘.",
      "passive": "연소상태 적 공격시 160 화염 원소 피해 추가 / 받는 빙결 원소 피해 20% 감소 / 다른 아군이 레인저류 무기 장착시 전개된 십자가의 화염 원소 피해량 40% 상승."
    },
    "화염의천사": {
      "oName": "화염의 천사",
      "type": "십자가",
      "short": "화염의천사",
      "img": "993DC63359B2486122",
      "spec": "공격 185 회심 10",
      "skill": "[SP 소모 : 20][쿨타임 : 15초] 십자가를 설치하여 전개한다. 7초 동안, 0.8초마다 주변 적에게 무작위로 적을 관통하는 화염구를 발사하여 적에게 680의 화염 대미지를 입히고 연소 상태로 만들어 3초 동안 0.5초마다 160의 화염 대미지를 입힌다.",
      "passive": ""
    },
    "디멘젼": {
      "oName": "디멘젼☆소나타",
      "type": "십자가",
      "short": "디멘젼",
      "img": "Weapon_Cross_T17_101_5",
      "spec": "공격 271 회심 38",
      "skill": "[SP 소모 : 8][쿨타임 : 20초] 십자가를 설치하여 전개한다. 10초 동안, 영역 내의 적에게 공격력의 250%의 화염피해를 입히며 영역 내의 아군이 가하는 원소 데미지를 15% 증가시킨다.",
      "passive": "폭발상태일때, 모든 데미지 40% 증가."
    },
  },
  "token_rev": {
    "유다": ["유다", "윾다", "유다의서약", "유다의 서약"],
    "짭다": ["짭다", "모조된유다", "모조된 유다"],
    "샄다": ["샄다", "삭다", "벚꽃의서약", "벚꽃의 서약"],
    "11쓰": ["11쓰", "11스", "일레븐", "일래븐", "시빌쓰", "십일쓰", "십일번가", "11번가"],
    "엘류드니르": ["엘류드니르", "엘류드", "엘루드"],
    "디멘젼": ["소나타", "디멘젼", "디멘전", "디멘젼소나타", "디멘전소나타", "디멘젼 소나타", "디멘전 소나타"],
    "레인저십자가": ["레인저십자가", "레인저 십자가"],
    "화염의천사": ["화염의천사", "화염의 천사"],
  }
}

export default weapon_holycross