const weapon_gauntlet = {
  "data": {
    "백조": {
      "oName": "백조문천",
      "type": "건틀릿",
      "short": "백조",
      "img": "9974BB4C5ADA94CA18",
      "spec": "공격력: 268 회심: 40",
      "skill": "[SP소모:5][쿨타임:16초] 모든 팀원의 회복량이 30% 증가하고, 자신의 공격속도가 40% 증가한다, 8.0초 지속",
      "passive": "공격시 SP회복속도가 25% 증가한다"
    },
    "태허": {
      "oName": "태허지악",
      "type": "건틀릿",
      "short": "태허",
      "img": "99ECBE4A5ADA94C81E",
      "spec": "공격력: 268 회심: 35",
      "skill": "[SP소모:17][쿨타임:25] 3개의 헌원검을 소환하여 적에게 투척, 각각 1,500의 화염피해를 주고 맞은 적에게 시공 고정을 겁니다, 4.5초 지속",
      "passive": "보통공격, 분기공격, 폭발공격, 출격기/QTE로 적을 맞추면, 캐릭터가 주는 모든 피해가 8.0% 증가합니다, 8.0초 지속, 다른 공격으로 인한 효과는 중첩되며, 같은 공격인 경우 지속시간을 갱신합니다."
    },
    "누아다": {
      "oName": "단광의 누아다",
      "type": "건틀릿",
      "short": "누아다",
      "img": "99E03E4A5ADA94C711",
      "spec": "공격력: 279 회심: 32",
      "skill": "[SP소모:15][쿨타임:20초] 전방의 적에게 공격력의 600%인 물리피해를 주고, 맞은 적에게 출혈을 걸어, 0.5초마다 600의 물리피해를 입힌다, 8.0초 지속",
      "passive": "전기원소피해 40% 증가"
    },
    "잔화지연": {
      "oName": "잔화지연 피스 메이커",
      "type": "건틀릿",
      "short": "잔화지연",
      "img": "993151385AF2A0970E",
      "spec": "공격력: 283 회심: 24",
      "skill": "",
      "passive": "점화/이화표식이 있는 적에게 피해를 줄 때, 20%의 확률로 공격력의 300%인 화염 원소 피해를 줌. 이 효과는 동일 적에게 1.5초 간격으로 발동 / 점화/이화표식이 있는 적에게 맞으면, 공격을 완전히 무시. 40초마다 한번 발동. / 캐릭터의 모든 원소피해가 20.0% 증가, 화염 원소피해가 20.0% 증가"
    },
    "행성고리": {
      "oName": "행성고리",
      "type": "건틀릿",
      "short": "행성고리",
      "img": "998B32385B253F411E",
      "spec": "공격력: 257 회심: 23",
      "skill": "[SP 소모:12][쿨타임:20] 목표를 끌어와, 공격력의 450%인 물리피해를 주고 5초간 이동속도를 80% 감소.",
      "passive": "분기공격 명중시, 캐릭터 주변의 적에게 2,500의 물리피해. (쿨타임 : 1.5초)"
    },
    "쌍랑": {
      "oName": "영원히 저무는 쌍랑",
      "type": "건틀릿",
      "short": "쌍랑",
      "img": "998B32385B253F411E",
      "spec": "공격력: 283 회심: 24",
      "skill": "[SP 소모 : 11][쿨타임 : 30초] 발동 후 지속적으로 충격파를 발생. 0.5초 간격으로 주변 적에게 공격력 50%에 비례한 물리 피해를 주며, 자신은 측후면에서 받는 피해가 65% 감소. 10초간 지속.",
      "passive": "공격이 명중시마다 입히는 물리 피해량 3% 증가. (지속 3초, 최대 10스택, 지속시간은 개별로 적용) / 감속상태(시공, 공속, 이속의 적에게 폭격률 10% 증가"
    },
 },
  "token": {
    "백조": "백조",
    "백조문천": "백조",
    "태허": "태허",
    "테허": "태허",
    "태허지악": "태허",
    "태허지약": "태허",
    "잔화지연": "잔화지연",
    "행성고리": "행성고리",
    "누아다": "누아다",
    "단광": "누아다",
    "단광의누아다": "누아다",
    "단광의 누아다": "누아다",
    "쌍랑": "쌍랑",
  }
}


// 제외

// 화염 궤멸자, 영총 야에, 파프닐
// 모신나강 태양, 타오르는 날개, 헌원 펄스 권총, 다크니스 핸드건, 봉총,
// 성총 카렌, 불의 요정 1형, 불의 요정 2형, 합금 허리케인 리볼버, 합금 지배자의 권총
// 프로토 펄스 권총, 개량형 콜트 아나콘다, 개량형 USP, M1911, 데저트 이글

export default weapon_gauntlet